[
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-09-22 01:55:31.000",
        "review": "Great book! This book helps keep my 2 year old son very entertained.  He loves looking at all the machines and naming them.  This book has saved us many times when we were out at restaurants or the doctor.  When we ask him to pick a book he routinely goes to this book.  Highly recommended.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2018-06-28 23:25:56.756",
        "review": "Five Stars. Must have for every little boy! Colorful and durable",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-12-25 19:34:38.000",
        "review": "This was a hit!! Little guy loves trains ... This was a hit!! Little guy loves trains and spent longer looking at this on Christmas morning than some of the flashy shiny type presents.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2017-02-20 19:04:36.000",
        "review": "Cute. Cute book!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2019-09-14 19:40:34.847",
        "review": "Perfect. Have a boy? Buy it!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2014-01-28 12:12:44.000",
        "review": "big and sturdy book, bold and comprehensive photos. This is a great book for the home or preschool setting where little ones may not always be gentle on books. The photographs are very clear and engaging and provoke conversation. There's no storyline of course, but the groups of vehicles are well organized. I ordered two for my classroom and they're extremely popular during independent reading.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-12-15 19:29:48.000",
        "review": "He LOVES it. My grandsons favorite book. He is 21 months.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2019-08-26 00:56:22.585",
        "review": "Excellent.  Thank you. Excellent.  Thank you.",
        "category": "Books"
    },
    {
        "rating": 2,
        "parent_asin": "0312498063",
        "timestamp": "2014-06-17 22:38:12.000",
        "review": "BORING. Disappointed.  I must not have been paying attention when I bought this.  There are no words other than just listing what each machine is so my little reader finds it boring.  Most of the machines are one in the same.  They use clever ways to list the same machines and vehicles to reach 100. Id pass, unless you just want a picture book for your child.<br />Ps, mine was for a two year old.",
        "category": "Books"
    },
    {
        "rating": 3,
        "parent_asin": "0312498063",
        "timestamp": "2012-03-08 19:11:23.000",
        "review": "Great Pictures, But... The pictures in this book are really beautiful. Bright colors, high quality, etc. But they are of things a baby (who this book is geared toward) would not really be able to recognize until they were a couple of years older. But by that time, they are not interested in just looking at pictures, they want stories to occupy them.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-08-12 02:14:57.000",
        "review": "It has nice clear pictures that are entertaining to view for a ... I bought this book and another book First 100 Trucks. It is a board book with a variety of vehicles. It has nice clear pictures that are entertaining to view for a child. The book is made to be abused. Great book for my son.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2010-09-29 03:01:53.000",
        "review": "Have A 2 Year Old Boy?  Then Buy This Book. I don't know what it is about 2 year old boys, but when they reach that age they become fascinated with machinery.  I've experienced it with all of my nephews, and the latest addition to our family is no different.<br /><br />This is a large-size, full-color, board book - meaning the pages are thick and sturdy.  All it consists of are photographs of real motorized machinery, taken from various angles, with the names of each vehicle shown.  There's a page devoted to types of cars, types of trains, types of boats, types of airplanes, types of construction vehicles, types of farm vehicles and types of emergency/city vehicles.  So it covers all the bases and is full of images to bring joy to a little boy's heart.<br /><br />My nephew reads this book every night with his father.  Then he reads it over with me when I babysit him.  There is just something so adorable seeing a 2 year old seriously pointing out a combine harvester or a dump truck as if it was the most important thing in the world.  Not to mention the fact that it's a good item to use if you want the little one to have some quiet time.  So if you've got a little boy in your family, or one that you need a gift for, I'd give this book two thumbs up.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2015-03-20 14:18:10.000",
        "review": "Five Stars. Our 14 month old son is obsessed with trucks and things that go. He absolutely loves this book!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2014-08-31 12:10:04.000",
        "review": "Big hit with a 2 year old. My grandson, age 2, loves this book.  Anything that 'goes' is a hit with him and this book has many more than his other books.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2013-04-21 23:27:44.000",
        "review": "Great book for little boys! My 2 year old grandson LOVES this book. It is great for teaching the names of various types of machines.",
        "category": "Books"
    },
    {
        "rating": 3,
        "parent_asin": "0312498063",
        "timestamp": "2016-08-21 16:20:37.000",
        "review": "Great pictures, Frustrating read. Great pictures, very colorful and keeps my sons attention, however I find it a little confusing for a FIRST book. My son points at every picture and claims car. However captions are sports car, family car, classic car, hot rod, race car etc.... It's fine when he's alone and just wants to look at the pictures but frustrating for him to be &#34;corrected&#34; on each picture",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-11-28 03:14:17.000",
        "review": "He like picture books in general. My 2.5 year old loves this books. He like picture books in general.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-02-01 15:00:18.000",
        "review": "Five Stars. My son loves this book and I'm learning all about construction vehicles!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2014-01-28 15:31:03.000",
        "review": "A GREAT BOOK! I highly recommend this product.  It features a wide variety of machines.  The pictures are beautiful.  I recommend it for toddlers and preschoolers!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-08-11 12:36:25.000",
        "review": "Five Stars. My grandson loved this book.  So excited to see all the trucks.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2015-01-26 01:41:22.000",
        "review": "Our son loves it! Great book for toddlers!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2017-06-09 15:43:43.000",
        "review": "we love this book!! instantly my son's new favorite book! big, durable, perfect!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-03-02 14:32:24.000",
        "review": "Vibrant photography. Lots to talk about.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2018-06-05 14:56:44.611",
        "review": "Great gift for a boy who loves trucks! Made the perfect gift for a 2 year old who love trucks.  As far as the bomb squad truck, it is a truck that exists so I see nothing wrong with it being in the book.  I asked the parent before purchasing to make sure they were okay with it.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2015-10-26 00:33:44.000",
        "review": "it's great for all genders. If you have a little boy...you need this book!  Actually, it's great for all genders.  Our nieces love it to.  We have one inside to learn and one in the car to look at as we drive and run errands for reference :)",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-08-12 15:46:28.000",
        "review": "My children both love this book. My children both love this book, drag them with them wherever the go. They love to point at the pictures and have mommy tell them the name.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2017-06-16 12:49:24.399",
        "review": "Oversized and great! My 2 year old boy LOVES this book. Oversized and great!",
        "category": "Books"
    },
    {
        "rating": 4,
        "parent_asin": "0312498063",
        "timestamp": "2017-06-11 20:17:21.239",
        "review": "I was sad to see no Tug Boat represented though. My 2yo loves this book.  She is very into auto, boats, planes and trains. I was sad to see no Tug Boat represented though, but an antiqudated Sail Ship was.6",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-08-09 19:28:41.000",
        "review": "Great for toddlers. My two year old son loves this book. He loves pointing at the different trucks when I call them out by name. Book is a board book and nice and sturdy and easy to wipe clean.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-11-05 01:26:06.000",
        "review": "He loves looking through it with us and pointing out his favorite vehicles (the race car. My 16 month old loves vehicle...but no so much sitting through storybooks.  This book was an instant hit however!  He loves looking through it with us and pointing out his favorite vehicles (the race car, the steam train, the school bus, and the scooter)!  It's a big book, and fun to look through together.  It's great for building vocabulary (for me too -- I had no idea there were so many kinds of tractors)!  The pictures are clear and the binding is strong and it will hold up to toddler hands.  Perfect for vehicle lovers!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-07-23 04:45:04.000",
        "review": "Five Stars. Great book. My 3 kids love it.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-01-01 01:52:30.000",
        "review": "Great colors and pictures. Bigger(11&#34;x11&#34;) board book. Great colors and pictures!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-05-20 16:28:02.000",
        "review": "Great for toddlers. I love that this is a big hard back book with board book pages and only cost me $8. My two year old son can sit and look through this for hours. We sometimes like to identify colors by finding cars etc that are the color we are looking for. Great for toddlers!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2012-03-24 22:37:15.000",
        "review": "Perfect for you Vehicle-loving toddler! My son is almost two and he loves all kinds of vehicles.  This book thrilled him and he slept with it the first couple nights.  He reads it almost every day.  He points to the pictures and asks me to tell him the name of each thing.  It has bright pictures, lots of cars and trains and boats, etc. from different angles.  Great book!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2014-02-15 22:47:39.000",
        "review": "Awesome book for your machine-loving kid! I bought this book for my 2 year old nephew for Christmas - it was such a hit, he ended up taking the book to bed with him!! I felt like the world's best auntie. His mother was excited because it's a board book and he likes to turn pages so quickly and excitedly, she doesn't have to worry about him tearing the pages. Each page has a theme (like types of trains, or trucks) and shows different types of machines of that type. This is a MUST for those toddlers in your life with an obsession with autos!!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2014-01-07 23:21:32.000",
        "review": "Baby ADORES this book. Our 9-12 month old (this is how long he's had the book), has loved this from the getgo, and, surprisingly, when asked on each page what his &#34;favorite&#34; is, responds by pointing each time. He adores the tractor and the racecar in particular.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2015-09-05 16:24:40.000",
        "review": "My 2.5 year old boy loves it. My 2 year old loves vehicles and I knew he'd love this book, he does. It's big.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2014-11-30 23:16:14.000",
        "review": "Nice and sturdy too. One of my son's favorites.  Nice and sturdy too.",
        "category": "Books"
    },
    {
        "rating": 4,
        "parent_asin": "0312498063",
        "timestamp": "2014-12-20 19:19:34.000",
        "review": "A Bit Much. Great pictures and plenty of variety...maybe too much?  Maybe just too much for what I was looking for.  So many different kinds of vehicles and names that it kind of numbs you to them.  All the different &#34;trucks&#34; just become &#34;truck&#34; instead of remembering some classics like &#34;fire truck&#34;, &#34;dump truck&#34;.<br /><br />Nevertheless, it is well put together and the images are high quality.  Maybe better suited for the preschooler to 1st grade when considering the variety and differentiation of different vehicle classes.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-09-21 14:32:19.000",
        "review": "The pictures are excellent and show a diverse range of machines. My 2 year old son LOVES this book. The pictures are excellent and show a diverse range of machines. The pages are huge and thick, so it is perfect for little hands. The cover has been very durable as this book as been everywhere with us. This book is a must-have for anyone with a toddler who loves machines and wants to know their names (as long as the parent can read along, of course!).",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2015-10-24 20:19:18.000",
        "review": "We love this book. We love this book. It is one of my sons favorites. He is 3 and he just loves this book and First 100 Trucks. Great books for great price. Thank you.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2009-12-28 00:14:05.000",
        "review": "Great book for boys. My son is almost 2 years old; I got this for him for Christmas and he loves it.<br />He loves to point at the machines and let us tell him what it is. Then we also reverse it; we ask him to locate the motorcycle, bus, etc.<br />It has pictures of just about every machine you see.<br />I think this says it's for ages 4-8; I'd say that's wrong and younger kids will like it. I would think older kids would want a story line, and there is no story.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2015-02-16 16:08:13.000",
        "review": "Great gift. Great gift",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2017-05-26 01:37:29.000",
        "review": "Great size! This has been my son's favorite book for months now.  He LOVES trucks and trains, so I knew this would be a good addition to his book collection, but he has learned so much more now! The pages are colorful and large, and it is definitely my kiddo's go-to book!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2017-06-29 06:15:16.661",
        "review": "Five Stars. My 2 year old son LOVES this book!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2017-11-04 01:29:18.831",
        "review": "Five Stars. these books are sturdy & cute.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2017-02-24 10:51:37.000",
        "review": "Big book! my 17 months son loves this book. He's crazy about cars and wheels since he just turned 1 year old. So I knew this would be perfect. The only flaw is that it's huge and he can't carry it anywhere. Nor can I.",
        "category": "Books"
    },
    {
        "rating": 4,
        "parent_asin": "0312498063",
        "timestamp": "2014-09-29 22:23:07.000",
        "review": "Four Stars. very good bright book with lots of things to look at",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2018-11-15 14:11:41.692",
        "review": "Great! Great little book, my daughter loves it :)",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2013-12-05 23:07:58.000",
        "review": "a nice book, well thought out. . This will be a great first book for my granddaughter. I believe she will enjoy it very much but I will not know until Christmas and then I will know for sure she likes books now, so she should like this one",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2013-07-24 18:36:20.000",
        "review": "1 year old - one of his faves. i personally think these kind of picture books with no story are boring but I don't think like 1 and 2 year old boys apparently.  My kid LOVES this book, and learned the name of all the vehicles really early on because of it.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2014-12-14 18:32:48.000",
        "review": "Five Stars. My toddler looks at this book every night before bed.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2015-03-08 03:48:53.000",
        "review": "Five Stars. She loves it",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2010-05-31 14:01:34.000",
        "review": "Asked for over and over again. We bought this book for our son's first birthday.  He's now 18 months old and absolutely loves it!  He brings it to us to read with him at least once a day.  We loved it so much we bought a copy for our daycare--and everyone there now loves it!  If a little person in your life loves things that go, this is a great choice.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2015-11-23 12:31:05.000",
        "review": "Better than what you pay for. Totally worth spending the money on this book. I bought the board book and got a 10x11 board book. I usually shy away from board books because I hate how small they are but this was 100% worth the money.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-11-02 20:18:32.000",
        "review": "tough enough, good color and big. we buy these for downs syndrome kids. they hold up for a couple months, which is actually better than a week. we will keep buying these.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2019-12-27 23:03:11.597",
        "review": "Perfect for kids who love trucks. Perfect book for kids who love trucks.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2013-03-23 00:04:19.000",
        "review": "A Wonderful Collection of Machines. Young boys and girls alike will have an interest in all of the machines they see around town, in the air, and seaside. This is great way to help them learn about their environment. They can't help seeing things that move around without wondering what they  are called and what they  do. Grandparents can thoughtfully give this as a gift or to keep for when the grandkids come to  visit.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2017-05-16 18:45:41.000",
        "review": "An entertaining vocabulary builder! Lots of great pictures to entertain and encourage vocabulary growth!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2017-01-16 23:01:22.000",
        "review": "Five Stars. good product",
        "category": "Books"
    },
    {
        "rating": 3,
        "parent_asin": "0312498063",
        "timestamp": "2017-05-26 18:09:45.000",
        "review": "Good book, but about vehicles and not \"Trucks\". The words used in here are interesting. Ex: an SUV is not called an SUV, it is a &#34;Family Car&#34; there is only one truck on the first page with mostly cars and classic vehicles. The second and third page have no trucks on them at all. The fourth page is emergency vehicles, the fifth is farm equipment. The sixth is construction heavy equipment, and the last page has big rigs and community vehicles (i.e. mail truck, garbage truck, etc.). Considering the name of the book, I was expecting more trucks. My son loves trucks especially, and I was fairly disappointed when there were only a handful in the entire book. It is a great &#34;first 100 vehicles&#34; book. But not necessarily a great &#34;Truck&#34; book.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2010-08-09 19:19:44.000",
        "review": "Toddlers love this book! My son got this book when he was approximately 18 months old and he wanted to read nothing else!  At age 2, he still loves all the pictures and quickly learned the names of all the machines in this book.  This book also helped him identify these same machines in the real world...he still loves all the tractors, emergency vehicles, and trains (okay, all of them) and points them out when we are driving around.  I highly recommend.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2017-02-18 03:37:56.000",
        "review": "Our little grandson loves this book! My husband enjoys ... Our little grandson loves this book! My husband enjoys looking at it with him and talking to him about the machines. It is a big book. I wish it would be the same size as the other 100 books.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-05-26 15:42:23.000",
        "review": "Five Stars. Nephew loves them. Bright and vivid pictures.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-04-01 20:24:44.000",
        "review": "Five Stars. My 20 month old grandson loves it.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2018-12-18 19:24:55.295",
        "review": "as described. book",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2018-12-22 20:02:02.325",
        "review": "3 year old approved! My son is obsessed with this book. It is large and has many pictures inside. Easy to go through and offers a great variety of vehicles. This would be a great gift for any little boy or truck lover! Super cute.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-07-14 21:21:24.000",
        "review": "Five Stars. awesome book",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2016-11-09 22:08:55.000",
        "review": "Five Stars. great item fast ship",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0312498063",
        "timestamp": "2013-12-04 21:54:38.000",
        "review": "Perfect for little boys. My son loves this book.  He has yet to memorize the 100 machines, but he's getting there.  I would highly recommend it.",
        "category": "Books"
    },
    {
        "rating": 1,
        "parent_asin": "0312498063",
        "timestamp": "2017-01-24 22:44:50.000",
        "review": "Came damaged. The book itself is awesome. However, when I opened the box, the book binding was already falling apart. I can't even close the book correctly without it looking bent and warped. Extremely disappointed. It was packaged fine so I know that this did not happen in transit.",
        "category": "Books"
    },
    {
        "rating": 1,
        "parent_asin": "0312498063",
        "timestamp": "2016-12-07 05:27:49.000",
        "review": "Do not waste money on the big book. Books is way to big!!<br />It is the same as the little book.<br />No different items.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2015-05-14 13:15:21.000",
        "review": "Get your Gi and get this book. This is the first book you should buy when your first start out.  It answers the mindset questions for each belt and what you should concentrate on while your on the mats.  I purchased one for me after I started and one for my buddy who just started.  Get rolling!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2014-07-13 12:29:36.000",
        "review": "Five Stars. a must have for anyone doing BJJ",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2017-08-27 19:23:33.846",
        "review": "A must read. Ok, this book is amazing.  I've been taking jiujitsu for years and I'm learning so much from this book.  I can definitely see referencing it for years to come.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2016-03-28 15:37:19.000",
        "review": "Best I've read. The best book I have ever read on Jiu Jitsu. I'm a bare bones beginner and this book gives a real plan that makes sense and I will be able to use it for years. I have looked at many JJ books but this is always the first go to book.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2018-05-17 16:37:18.237",
        "review": "Five Stars. Great book at explaining movements in detail, lots of pictures. Definitely helped me as a white belt.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2018-08-09 16:30:01.977",
        "review": "The jiujitsu bible. I bought this back when I first started brazilian jiujitsu.  Nine years later after many lay offs, injuries and career changes I am still practicing the art.  I am a purple belt and I still learn from this book and get reference from it.  The Ribiero's are treasures in the BJJ community.  They are Old School and know their stuff.  This should be your first book and I always recommend when the new guys are bit with the bug.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2020-12-04 18:30:16.672",
        "review": "Get it. Awesome book. Taught me a lot",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2015-09-07 18:10:53.000",
        "review": "Love it. Great book!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2019-05-14 15:52:05.411",
        "review": "Good info. Good info",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2019-06-14 12:24:29.105",
        "review": "Doesn’t get any better. Bought this for my son great book for at home practice",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2015-11-01 01:33:40.000",
        "review": "One of the best Brazilian Jiu Jitsu books out there. One of the best Brazilian Jiu Jitsu books out there.  If you're looking for a book to supplement you're training, this is the one.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2018-02-24 19:44:20.216",
        "review": "Comprehensive review which is rapidly accessible with step by step ... Comprehensive review which is rapidly accessible with step by step images and descriptions that highlight key details to make moves work. I use continuously for review before and after practice.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2017-02-08 20:14:35.000",
        "review": "Five Stars. Bought for my daughter she loves her instructor was part of it",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2016-10-17 23:02:52.000",
        "review": "Five Stars. Have to have some background in jiujitsu in order to understand. Not a book about submissions, but ground work.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2020-01-04 22:08:51.964",
        "review": "Well organized book to supplement training. I'm a white belt that bought this book. Reading this alongside what I'm being taught at my academy has really improved my rolling and my instructor has already noticed and praised me for it. Overall, the techniques for survival, escaping, guards, and submissions are awesome to read and look at to supplement your training, drilling, and rolling. The step-by-step descriptions and photos really help. Also, this is an extremely organized book. I just wish it had a section on takedowns.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2013-10-05 01:40:24.000",
        "review": "great reference. this book helps me understand what is bjj and its very intricate system and techniques. Although nobody can replace the teaching and guidance of an instructor, this book is an added help for some fundamentals techniques to know in each belt level.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2009-02-15 11:48:29.000",
        "review": "Effective. This book was recommended by my jiu jitsu instructor to supplement our training.  Saulo is highly effective in his explanations & photographs of techniques.  The techniques he teaches are top notch and extremely useful in Brazilian Jiu Jitsu.  I've recommended this book to other fighters and they have loved it too.  Worth every penny!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2017-06-23 16:20:08.994",
        "review": "Good book, some things are a little advance for ... Good book,  some things are a little advance for me becouse i am a white belt but i have already use some of the most basic things, nice book easy to read and the pics helps a lot too.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2016-12-22 13:20:53.000",
        "review": "this would be the one I recommend. Saulo is a respected professor and world champion. If you could only get one book on Jiujitsu, this would be the one I recommend.  Saulo is a respected professor and world champion.  The advice and techniques laid out in the book are easy to follow, and the concepts flow through all belt levels.  10 Stars!!!!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2021-09-03 03:20:12.647",
        "review": "Awesome. This won’t teach you everything you need to know about Brazilian jujitsu, but it’s a fantastic teaching aid when not in the gym. I highly recommend it for anyone interested in bjj.",
        "category": "Books"
    },
    {
        "rating": 3,
        "parent_asin": "0981504434",
        "timestamp": "2018-11-24 22:28:43.982",
        "review": "Not worth it. Just look it up on you tube",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2013-05-19 11:21:40.000",
        "review": "loved the clarity and style of instruction. loved the clarity and style of instruction.  Ribeiro understands how to communicate and to convey his knowledge on the subject. It is a good primer for the BJJ student.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2016-10-29 16:19:47.000",
        "review": "Great reference to look at after having my early morning ... OSSSS. Great reference to look at after having my early morning berimbolos for breakfast.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2017-03-29 21:52:45.000",
        "review": "Covers Fundamentals well! Well written book.  Covers the fundamentals in detail with drills.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2020-03-03 13:44:29.357",
        "review": "Great Book. if you are just starting the beautiful art of BJJ give it a read",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2014-09-25 18:09:24.000",
        "review": "Five Stars. Excellent book!",
        "category": "Books"
    },
    {
        "rating": 4,
        "parent_asin": "0981504434",
        "timestamp": "2016-07-24 02:58:20.000",
        "review": "Great book for anyone on white to blue level. I think is a good book about basic jiu jitsu, if you don't know anything is great for you. Basically it give you an idea of what you need to learn in every belt level. He give you some examples of how to survive at white level, escapes at blue level, guard at purple belt etc...I was looking for something more advanced but I'm happy with this book because I learned some techniques and escapes that I didn't know and it gave me ideas of how to improve my game. If you have years in jiu jitsu you don't need this book but I highly recommend it to anyone on white and blue level.",
        "category": "Books"
    },
    {
        "rating": 4,
        "parent_asin": "0981504434",
        "timestamp": "2015-12-31 16:39:50.000",
        "review": "Four Stars. good product, fast delivery",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2012-07-24 21:12:23.000",
        "review": "great book on BJJ. I like how this book explains the concepts behind techniques and also gives common mistakes for when techniques go wrong. I also like how the book breaks down what you should be focusing on for all belt levels, however this does not mean that you should not start to learn and apply passing the guard techniques until you have mastered everything that comes before it in the book. I would say that the most beneficial section of the book for me so far is the passing the guard section, although I am only a blue belt these techniques that can be found in the brown belt section of the book have really helped me pass more effectively.<br /><br />I definitely recommend this book for lower level belts trying to improve their techniques. I am not sure how much a higher level belt would get out of this book but it has definitely helped me on identifying some technical mistakes I make often.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2014-08-30 04:38:25.000",
        "review": "great book on bjj. fills in a lot of the missing puzzle, speaking as a white belt, it brought me up to speed after about a month of training, i picked up this book.  i'd recommend it, and feel it has much more in store to teach or supplement my training, when the time comes i am ready",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2015-05-06 19:23:58.000",
        "review": "Five Stars. If ever there were a term for baby steps in a martial arts book, this is it.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2015-05-23 22:34:24.000",
        "review": "Incredible Book for Fans of Brazilian Jiu-Jitsu. This book is incredible. I purchased it prior to a deployment I went on where I couldn't practice any Jiu-Jitsu. It covers everything from basics to advanced techniques with simple descriptions and multiple photographs at different angles. I highly recommend this book as a companion to a BJJ class or something to study when you are in an environment where you can't practice regularly.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2014-05-13 09:22:50.000",
        "review": "White belt must-read. Great narration teaches you step by step, how to survive, then how to escape, then how to turn tables, then how to get a dominant position and finally how to finish your opponent. All in all a great material to patch holes in your game.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2022-01-08 02:37:22.042",
        "review": "Excellent Techniques and Philosophy. Much better than a few other books I tried. A truly excellent book that introduces concepts and also gets into deeper techniques later in the book.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2015-07-17 04:46:57.000",
        "review": "Five Stars. Love this book....great buy!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2013-07-02 13:35:16.000",
        "review": "Still the best book available. This is a fantastic tool for beginners to supplement their regular training.  So many great concepts and techniques that can be applied quickly and easily.  Excellent quality and the pictures and descriptions are very clear.  There's a reason this is recommended so highly year after year.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2008-12-20 03:59:39.000",
        "review": "Not for No GI. I have read through most of this book and have skimmed through the whole thing.  It is a really good book for learning the intricacies of BJJ.  If you roll in a Gi then you will definitely want this book.  It gives very detailed instruction about all the things you wondered about and your instructor forgot to tell you.<br /><br />I have many BJJ and MMA books and there is one thing that sets this one apart from every other book.  It is the non-submission stuff. I have been saying for years that I want a book that talks about sweeps and escapes.  Finally we have one.  This book is the missing link for BJJ books.  It tells all the stuff that all of the other ones don't.<br /><br />The only bad thing is that it doesn't talk much about no gi.  In all actuality a lot of the stuff is different then the way you would do it if someone were throwing punches at your face.  But then again, it doesn't claim to be a MMA book.  So it is true to it's word.  I just wish it had a nogi section.  If he comes out with any other books I will be the first to buy it.  Best BJJ book out there!!!!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2014-04-04 23:24:08.000",
        "review": "Awesome. Great color pictures from different angles detailing important steps. Techniques range in everything from very beginner to very advanced. Descriptions are great as well, technical but easy to understand with the all-important &#34;why am I doing it this way?&#34; always being answered. Not a substitute for getting out on the mat, but a great supplement to it and will definitely advance your skill set!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2019-09-26 01:42:07.796",
        "review": "Great BJJ book. Wish I had this book when I first started rolling.  Very informative with corresponding pictures.  Been able to supplement my rolls with the information in this book.",
        "category": "Books"
    },
    {
        "rating": 4,
        "parent_asin": "0981504434",
        "timestamp": "2015-01-17 21:00:27.000",
        "review": "If you want to roll, get this book! Outstanding!  I love it, my son-in-law loves it, my grandson loves it!  Got a copy for each of us!<br /><br /> I only wish the book had information re. warm-up exercises, match rules.<br /><br />A great deal of effort went into the dialog and production of this book.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2016-02-05 15:28:52.000",
        "review": "Five Stars. Great book",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2015-07-13 13:56:41.000",
        "review": "Best BJJ book. A must for any BJJ practitioner, great guide to understanding what is expected at each belt level.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2014-09-18 16:23:05.000",
        "review": "Great book. Goes through white and blue belt. Very in depth.  Great book.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2018-06-26 22:52:30.160",
        "review": "Worth it! very well illustrated with front and side views of each position.  Excellent investment in my BJJ journey",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2021-04-13 23:09:38.115",
        "review": "Great for learning technique. Excellent for anyone that wants to practice at home. As a white belt, I’m trying to understand both techniques and strategy and this does a great job of breaking it all down one step at a time! I’m rolling with higher belt guys and they are definitely noticing my skill level improves each week because of what this book is teaching me at home. It’s a secret weapon!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2016-09-25 09:49:08.000",
        "review": "Be hard to kill. Be hard to kill.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2016-05-11 19:33:24.000",
        "review": "Highly recommended book. Excellent book. There's a lot of photos that show the details of each move, often from more than one angle. This book organizes the information in a stylized belt format, but you should by no means limit yourself as such. I.e.: A white belt should be reading ahead through the whole book, not just stopping at the white belt section. Saulo shares valuable knowledge and principles in here.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2020-01-07 03:22:23.224",
        "review": "Great for all levels. Perfect reference material",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2016-04-22 18:35:42.000",
        "review": "Five Stars. excellent",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2019-08-29 14:43:56.956",
        "review": "Great compliment to my training. I'm 6 months in as a female white belt at 49.  I love drilling but rolling can be quite intimidating.  I overthink & my mind goes blank.  Ribeiro's approach of white belt survival has been pivotal in raising my confidence level & therefore my steady improvement.  I am able to protect myself & buy a little time to think.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2012-12-01 16:08:22.000",
        "review": "wow. Saulo Ribero is in California, I am in Texas but with this book I can get tips from the master himself. Xande is featured in the book and I am not at all disappointed with the material. It has helped my Jiu Jitsu game. The first part is survival which when employed really does keep you on the mat and away from tapping. Very pleased with this purchase and its a good bargain here on Amazon. Stop reading the review, buy the book, read that then get back to the gym!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2019-07-13 05:33:33.383",
        "review": "Cumple con todas las expectativas. Muy descriptivo y de mucha ayuda",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2018-07-09 14:26:48.562",
        "review": "Provides great pictures as. I got this for my husband and he LOVES it.  Provides great pictures as well",
        "category": "Books"
    },
    {
        "rating": 4,
        "parent_asin": "0981504434",
        "timestamp": "2017-05-18 02:42:26.000",
        "review": "This Helps Your Experience, You Should Still Attend Classes. I am actually someone who had prior experience in terms of Martial Arts, though I do think in our modern world...it's important to actually know how to defend yourself. You can't bring weapons with you everywhere and what will you do when you might be in a situation where your life or health is in danger? You need to defend yourself. This book gives good reading as well as illustrations to help display points that you might need to use if you find yourself in dangerous situations...male or female this can potentially be a life saver.<br /><br />The book isn't meant to be a substitute for actual peers or instructors, it's to help you retain what you learn in a class. That's a very important thing that people need to know if they decide to buy this. Reading it and practicing the pictures won't make you proficient in the art. You need proper training and discipline to do that. The book simply helps you along your journey, no matter what it may be or to where it will take you.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2017-05-25 13:44:09.000",
        "review": "easy to follow. easy to follow, pictures explain techniques. I am a beginner in Jiu Jitsu so the book helps with the moves",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2015-07-06 17:15:24.000",
        "review": "Excellent book. Must have for white belts. Excellent book. Must have for white belts. Pay attention to the way Saulo breaks down techniques by belt. First mission of the white belt is to survive.",
        "category": "Books"
    },
    {
        "rating": 4,
        "parent_asin": "0981504434",
        "timestamp": "2015-11-30 13:29:08.000",
        "review": "Four Stars. Arrived on time exactly as described",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2019-08-24 02:35:47.307",
        "review": "good. good",
        "category": "Books"
    },
    {
        "rating": 4,
        "parent_asin": "0981504434",
        "timestamp": "2015-12-28 20:24:50.000",
        "review": "Four Stars. excellent.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2017-04-01 22:36:56.000",
        "review": "Five Stars. Good",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2016-03-04 03:43:08.000",
        "review": "Essential. This will take a while to get through. Great supplement and reference. This seems to be the de-facto book on BJJ. If you don't know the techniques in this book then you will be missing out.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2019-08-20 11:32:45.516",
        "review": "Very good. Good training reference.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2014-10-11 04:25:28.000",
        "review": "Back to Basics. It is quite amazing this book.  Instead of focusing on the latest razzle dazzle moves, Saulo focuses on the basics but leaves no stone unturned.  After having a year and a half of training, I picked this up.  All the moves are easy to add to your game, and most will be things you already know.  While this is by no means the definitive collection of moves, this book will help develop an essential and solid foundation.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2017-09-07 18:31:46.851",
        "review": "Five Stars. Best book you can buy",
        "category": "Books"
    },
    {
        "rating": 2,
        "parent_asin": "0981504434",
        "timestamp": "2021-08-30 01:57:35.669",
        "review": "Wonderful book - horrendous shipping. The book is great and it’s easy to follow. The way it was delivered is abhorrent - a soft cover book in a bag, what could go wrong? Maybe I should’ve bought a used book in the first place since mine came looking like it was banged up.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2018-10-07 19:05:21.605",
        "review": "Five Stars. Great read",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2019-04-11 03:42:46.638",
        "review": "Good buy. Great book loaded with info.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2015-06-25 11:40:13.000",
        "review": "Excellent relevant advice and examples from white belt to black ... Excellent relevant advice and examples from white belt to black belt.  THE BEST Jiu-Jitsu reference book that you can buy!",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "0981504434",
        "timestamp": "2021-07-24 17:05:14.935",
        "review": "Good book to study. This is a great choice to study stuff. Especially, if you are being used as a mop for the mats.",
        "category": "Books"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2017-10-29 18:53:20.376",
        "review": "Highly recommend. This is an excellent CD--very relaxing--the other day I played it for background dinner music and my guests noticed it and wanted to know what is was called and asked how to buy it---so glad I purchased this CD!",
        "category": "Digital_Music"
    },
    {
        "rating": 3,
        "parent_asin": "B00004YX36",
        "timestamp": "2013-06-14 02:41:32.000",
        "review": "Excellent selections... Was not expecting them to be the 'soft' versions of these pieces. But, as stated, it is relaxing. Thank you.",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2014-05-16 21:19:50.000",
        "review": "Nice CD. Easy listening music after work, reading the mail,petting the cat.  I think I will go and put the CD on now, it's nice.",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2023-01-08 20:40:51.406",
        "review": "Nice listen. Thanx",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2010-12-04 02:18:19.000",
        "review": "Music that relaxes. One of my two favorite adagio recordings. Perfect to read by, fall asleep to or to be with that special someone.",
        "category": "Digital_Music"
    },
    {
        "rating": 4,
        "parent_asin": "B00004YX36",
        "timestamp": "2018-05-16 15:50:22.775",
        "review": "good for rush hour traffic music. Very relaxing, good for rush hour traffic music.",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2013-03-13 13:43:10.000",
        "review": "Fantastic for unwinding. Gorgeous CD ... would recommend to anyone who wants to kick back and release all the tension from you day. This has become my favorite CD - it has a permanent place in my multi-disk CD player so that I can queue it up any time I like. The selections are perfect, and are sequenced nicely. The Debussy pieces are especially beautiful.",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2014-07-10 00:18:09.000",
        "review": "Good mix of timeless selections. First heard this at my esthetician's, who provided me with info so I could order it for myself.  Now, I'm able to experience that feeling of calm and relaxation it creates, at home, whenever I choose.  Good mix of timeless selections.  Highly recommend.",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2017-04-29 04:09:38.000",
        "review": "Sleep time. Very nice to sleep to. I changed the order of the tracks and burned another CD, putting those with louder crescendos near the beginning.",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2016-01-29 23:36:03.000",
        "review": "This is music for dimmed lights, a fire in ... This is music for dimmed lights, a fire in the fireplace, a cigar, and a very old port.  Poured from a Waterford crystal decanter.",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2016-02-08 03:41:05.000",
        "review": "Very beautiful and relaxing music. When I first reviewed this CD I gave it four stars. However, each time I listen to it I like it more, and now give it five stars.",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2013-06-03 17:42:43.000",
        "review": "Essential Relaxing Music. This CD provides essential relaxing music, for setting the mood for relaxing prior to going to bed.<br /><br />What more could a person ask for?",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2014-05-09 23:22:28.000",
        "review": "Perfect relaxing compilation. I always seem to be thrilled with the compilations that this company has offered. The artwork is cute also. Relaxing, soothing, quiet to work by, read by, nap with, rest with.",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2015-09-11 12:49:44.000",
        "review": "Five Stars. I absolutely love it!",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2015-05-24 02:38:55.000",
        "review": "Easy to listen to. Easy to listen to, relaxing music. Unhappily, most are the standards that are available elsewhere, but if you like relaxing music, this is the CD for you.",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2017-05-12 20:01:22.000",
        "review": "Good Relaxing Music. Relaxation and /orSleep here I come.!",
        "category": "Digital_Music"
    },
    {
        "rating": 4,
        "parent_asin": "B00004YX36",
        "timestamp": "2013-08-15 22:00:25.000",
        "review": "Adagios . I play cd as I go to sleep at night.  Usually, I don't hear it to the end  a good sign!",
        "category": "Digital_Music"
    },
    {
        "rating": 4,
        "parent_asin": "B00004YX36",
        "timestamp": "2015-04-25 02:51:39.000",
        "review": "I'm retired and like to take a nap after lunch and on most ... I'm enjoying Adagios For After Hours.  I'm retired and like to take a nap after lunch and on most days I play Adagios For After Hours to help put me to sleep, which it does very nicely.  Another CD that I like to listen to while relaxing is Bach at Bedtime.  Both of these CDs are excellent sleep aids!",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2013-10-24 14:44:50.000",
        "review": "Way to Relax. This is a wonderful CD for anyone who has difficulty relaxing!  It is so soothing that I can't really use it at the office - too relaxing, but at home while reading or just napping - it's great.",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2015-09-18 15:08:12.000",
        "review": "Five Stars. Beautiful collection! Very enjoyable.",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2003-02-03 18:40:07.000",
        "review": "Absolutely perfect. This is a wonderful collection of some of the most beautiful, relaxing classical music composed by the greatest artists of our history. My personal favorites, Claude Debussy, Maurice Ravel, and Gabriel Faure, are well represented here. The selections are made based on their ability to relax, and transport you to another place. They certainly succeed. In these troubled and stressful times, we need to return to another period, to music that had the ability to transform and to heal. I feel that once this CD is playing, I don't need anything else to relax me. This is beautiful, timeless music, that will never go stale.",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2013-12-26 02:40:55.000",
        "review": "My daughter listens to every night. As my description said, my three year old listens to this every night at bedtime and really enjoys it. Would order again",
        "category": "Digital_Music"
    },
    {
        "rating": 4,
        "parent_asin": "B00004YX36",
        "timestamp": "2015-04-15 20:28:10.000",
        "review": "Four Stars. enjoyable",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2015-11-02 09:35:47.000",
        "review": "Five Stars. Very enjoyable selection by accomplished artists",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2013-04-22 11:17:50.000",
        "review": "Really lovely music! If you like Debussy, Vivaldi, Bach, Mozart and Beethoven all in one CD, buy this one.  It is the cheapest one, and it is the best one - honest.  I listen to it all the time.  It is very relaxing and sweet, it makes me happy too!  This is a bargain, pick it up, and you will see!",
        "category": "Digital_Music"
    },
    {
        "rating": 4,
        "parent_asin": "B00004YX36",
        "timestamp": "2013-06-12 19:01:27.000",
        "review": "enjoy. Some days you just need to RELAX AND this helps you do it. It would have been a 5 except for the level of sound. The quality seems to be okay, but maybe that is why it doesn't get very loud. (I'm a grandmother of 7, Not looking for a boombox sound) Just would like it a little louder. I like the arrangement of songs on this CD.",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00004YX36",
        "timestamp": "2015-07-07 20:14:01.000",
        "review": "Five Stars. Beautiful relaxing compilation, some unusual selections not usually found on other CD's",
        "category": "Digital_Music"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2015-03-04 08:46:36.000",
        "review": "Thriller 5 stars movie !!!!!!! This is Jennifer Lopez movie. ... No need to talk too much ... its ENOUGH.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2015-11-09 22:16:18.000",
        "review": "Five Stars. one of my favorite movies,",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2017-03-30 01:11:20.000",
        "review": "Five Stars. Great product.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2013-12-28 18:35:52.000",
        "review": "HEY. I LOVED IT. PLEASE PUT UP MORE ITEMS LIKE THS ONE. keep the soundtracks for my desired movies coming. cool",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2005-04-26 21:18:08.000",
        "review": "Very Good Movie! I was lucky enough to find this at Wal-Mart for $5.50. I had seen it before but I had forgotten how good it really is! I love the way the stalker becomes the prey and gets what he deserves! Go Slim!!",
        "category": "Unknown"
    },
    {
        "rating": 3,
        "parent_asin": "B00006HAWN",
        "timestamp": "2004-05-08 19:04:24.000",
        "review": "It Is Good For Being A J.Lo Movie. Movie critics always seem to hate three things:Overused plots,good-looking movie stars,and J.Lo.Almost every critic I know hates J.Lo's movies,including this one.Sure,it has all three things,but you can't help but put it in the guilty pleasure category.And,I have to admit that J.Lo does a pretty good job acting on this one,being semi-convincable as an abused woman.And the other guy in the movie(sorry,I can't figure out his name)plays a pretty good villain,since youi want to kill the (...) during the whole movie!And the little girl is the cutest little girl since the girl in the Pepsi commercials.And,you have to admit that this is one of J.Lo's best movies,which isn't really saying much,but it still is one of her best!<br />But,there's just something about it that people don't like,including me sometimes.J.Lo is a little too exaggerrated in the acting department,and the last half is completely unrealisitic and ruins the beginning half of the movie.<br />Yet,you really should at least give this movie a chance.The little girl is one worth watching.And ignore the horrible song \"Alive\" by J.Lo,which is a part of the special features.Sure,it's not \"The Burning Bed\",but what do you expect?J.Lo's in it,after all!",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2017-11-06 21:08:53.644",
        "review": "Five Stars. Good movie",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2015-07-04 15:59:13.000",
        "review": "GREAT. LOVE THIS DVD,  EVEN BETTER THAN  SHALL WE DANCE. THE LITTLE GIRL IN IT,THAT PLAYED HER DAUGHTER SHOULD HAVE GOTTEN A OSCAR.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2019-10-01 16:16:51.625",
        "review": "great picture  / great sound. Classic. Love this movie/ Great picture/great sound",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2018-01-18 02:34:14.950",
        "review": "A favorite. Edge of your seat movie. Love it.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2018-03-06 22:54:39.572",
        "review": "Great Movie for Anyone Who's Had ENOUGH! If you need a movie to empower you and kick some a**, this is it. After her seemingly charming husband flips the script and becomes abusive, Jennifer Lopez finally has &#34;Enough&#34; and learns how to defend herself. I won't give anything else away, but this is a great movie that deals with some of the realities of being in an abusive relationship. Of course, there's a dash of Hollywood in there, too.",
        "category": "Unknown"
    },
    {
        "rating": 2,
        "parent_asin": "B00006HAWN",
        "timestamp": "2004-03-22 23:53:25.000",
        "review": "More Than Enough ... In Fact, Way Too Much. Yet another movie that starts with an intriguing, compelling premise and then veers off-course into insipid melodrama.  Jennifer Lopez stars as a woman who meets an apparent Prince Charming (Billy Campbell); the couple are soon wed and start a family.  Everything appears to be headed towards &quot;Happily Ever After&quot; until Lopez discovers that hubby has a mistress on the side.  When confronted, Campbell peels off his mask and reveals himself to be, in fact, a chauvinistic wife-beater.  Lopez resolves to take their daughter and run ... and it's at this point that the movie breaks down, with Campbell persuing his fleeing wife with all the mechanized determination of The Terminator.  The plot gets steadily cornier, with the down-and-out Lopez luckily getting financial help from her estranged multimillionaire father (wouldn't it be great if all abused wives just happened to have untapped resources like that?), and then receiving the training necessary to - literally - become a female Terminator herself, after which she engages Campbell in a brutal fight-to-the-death.  (I'll let you guess who wins.)<br />The two leads give interesting performances up until the time the script requires their characters to turn cartoonish, and they are given able support by Juliette Lewis as Lopez's best friend.  The wonderful and capable Dan Futterman is pretty much wasted in the thankless role of Lopez's loyal former beau.  The best performance in the film is given by Noah Wyle, playing against type as a hot-tempered renegade bad cop with a very bad case of road rage; it would be interesting to see Wyle play this type of role again, but in a better film.  As satisfying as it might be to see an abusive brute get back better than he dished out, &quot;Enough&quot; is ultimately way too incredible and far-fetched to deliver genuine thrills.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2019-01-04 17:41:42.043",
        "review": "Enough Movie. Well packaged and new",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2018-04-26 13:41:46.733",
        "review": "Five Stars. Love this movie!",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2012-12-12 19:23:07.000",
        "review": "Excellent service. The item came as shown. Perfect condition. The shipping was very speedy and it was wrapped very secure. I am very satisfied. Thank you for great service. I highly recommend to any buyer who is looking for good quality shipping and customer service!",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2019-03-11 19:59:46.740",
        "review": "great. great film",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2020-05-05 08:20:33.898",
        "review": "I Love This Movie. It's a simple story with a decent group of actors. I'm a big fan of the main characters transformation in the movie. I've watched it more than a couple times.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2019-07-10 23:17:58.528",
        "review": "Love it! Came in great condition!",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2020-11-26 17:06:29.086",
        "review": "Good movie. We show this in domestic violence class because it demonstrates the cycle of abuse",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2017-03-28 14:32:11.000",
        "review": "The person who I bought this for loves this movie ... The person who I bought this for loves this movie so that's why I got it for her and it arrived when it said when it was coming",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2011-12-08 19:27:49.000",
        "review": "Great Movei. I think this is the first Jennifer Lopez movie that I actually liked. Plenty of action and the ending will have you sitting on the edge of your seat. Just a great movie.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2016-04-29 13:09:52.000",
        "review": "Five Stars. Great movie",
        "category": "Unknown"
    },
    {
        "rating": 1,
        "parent_asin": "B00006HAWN",
        "timestamp": "2004-01-03 16:42:15.000",
        "review": "boring. This movie was boring, and predictable, don't waste your hard earned money on this flick.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2018-07-01 18:37:58.631",
        "review": "Awesome !!!!!!!!! Awesome !!!!!!!!!",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2014-08-13 02:55:21.000",
        "review": "Five Stars. love it",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2014-08-10 00:03:27.000",
        "review": "Great movie! I am not a Jennifer Lopez fan. Great movie!  I am not a Jennifer Lopez fan, but she did a great job in this one.  Good quality dvd and great price.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2009-11-24 17:03:05.000",
        "review": "Enough. This was a very good movie this was something I had to get I am glad that I got it J low is so good in this movie I love the action in this I can say no man should hit a woman but I think she puts this guyt in his place I am really glad I got this thanks again",
        "category": "Unknown"
    },
    {
        "rating": 1,
        "parent_asin": "B00006HAWN",
        "timestamp": "2015-02-18 04:49:39.000",
        "review": "Bad acting, bad dialogue, bad casting choices...etc. I'm going to be brief because there aren't enough adjectives in the English language to explain how awful this movie is. So I'll just stick with the facts and leave it at that.<br /><br />This movie is supposed to be about domestic abuse. I thought at first I'd selected the wrong title on Netflix, because despite the plot summary and thriller-esque video cover, this film opened up with all kinds of frills and silliness. The scripty font and lighthearted music in the beginning actually made me think this was a romantic comedy. Then I couldn't decide if it was comedy or some kind of thriller parody flick, because Juliette Lewis is saying to Jennifer Lopez, arguably one of the most beautiful women alive, that she's so plainly she'll never get a date. And Lopez looks put out and mopes around because she seems to take her friend's words to heart and believe they're true. Then some customer at the restaurant she's working at starts hitting on her, only to soon reveal it was all a game to see how fast he could get her in bed, because she's so homely she will sleep with anyone and he thought he could win an easy bet.<br /><br />I'm sorry... Jennifer Lopez, playing a &#34;plain Jane&#34; with no hope for any man really wanting her? They didn't even try to make her look anything other than stunning and glamorous; from the get-go she's got highlights in that gorgeous honey-blond hair, and her makeup is perfection. If that doesn't warn you what a farce this flick is going to turn out to be, there's nothing else I can say that will dissuade you from getting your hopes up. It might have worked if they chose an actress who A.) can act and B.) isn't drop-dead gorgeous, but...well, that was their choice and it just didn't play out the way it was supposedly meant to. Unless this was a parody film. I am really still not even sure.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2014-12-14 19:44:24.000",
        "review": "Five Stars. This was a gift.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2017-12-08 04:21:38.978",
        "review": "An Excellent, Underrated Film. I think this is a very good film. The script and storyline are excellent and believable. I almost always like films when the underdog wins against all the odds. Jennifer Lopez is perfect in this role. I think she's a very good, underrated actor - I've liked her in every film I've seen her in (especially Selena). In this film, she portrays a woman who is physically and emotionally abused by her husband, an all too often tragic situation that women find themselves in. In this case, she is desperately trying to protect her daughter first and herself second. All the supporting cast members are very good as well. I especially like Tessa Allen who plays Jennifer's young daughter. This was Tessa's first film and she's now twenty-one years old; still doing commercials and acting. Kudos!<br /><br />I've seen this movie many times on TV and I finally ordered it today for my DVD collection.<br /><br />The filmmakers decided to use Aimee Mann's song &#34;Today's the Day&#34; in the film. I bought the song as an mp3 a couple of years ago. The song is modified for the film but the modification is appropriate for the film. The song is not on the soundtrack. It's from Aimee Mann's &#34;Lost in Space&#34; album.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2020-06-04 02:54:56.837",
        "review": "I adore this movie!!! I love this movie!! As a battered wife survivor oh how I wish I could have seen this movie many many years ago!!!",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2014-09-18 17:26:36.000",
        "review": "Five Stars. thank you",
        "category": "Unknown"
    },
    {
        "rating": 4,
        "parent_asin": "B00006HAWN",
        "timestamp": "2019-10-30 22:30:22.573",
        "review": "Must see. Nice flick",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2015-01-26 18:49:52.000",
        "review": "Great movie. This is one of my favorite Jennifer Lopez movies, would definitely recommend",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2015-08-19 21:11:56.000",
        "review": "Great price and value. Paid more for the shipping than the actual movie itself.  It was a gift, and I haven't heard anything negative (and trust me, I would) so I'm sure it's fine.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2003-03-17 00:37:52.000",
        "review": "J. Lo. i was feeling this movie. at first i thought it was gonna be stupid but then when i went out and bought the movie i liked it. this is a movie for the women who think that they cant beat a man. women may think that but if they try hard enough then they'll do something bout is or u'll get tired of a man whooping on u. so if u havent seen this moie then u should go and see it cus its a good movie. holla",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2015-10-24 23:18:54.000",
        "review": "Five Stars. Love this movie",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2017-03-07 06:03:09.000",
        "review": "Super movie, Super Cellar, excellent experience. Fantastic movie come in great shape, and it was delivered expediently. Couldn't get better.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2015-09-12 03:15:58.000",
        "review": "In my opinion, one of Jennifer Lopez's top performances ... In my opinion, one of Jennifer Lopez's top performances since Selena at this point in his career. This was a serious performance and showed off Jennifer's range as an actress. Give it a try; its worth it.",
        "category": "Unknown"
    },
    {
        "rating": 4,
        "parent_asin": "B00006HAWN",
        "timestamp": "2020-05-24 00:39:36.037",
        "review": "Have an unauthorize charge on account. Need a contact  to customer service.",
        "category": "Unknown"
    },
    {
        "rating": 4,
        "parent_asin": "B00006HAWN",
        "timestamp": "2004-07-26 00:27:41.000",
        "review": "Empowering. This movie focuses on the ideals of femininity and female empowerment. Slim (Jennifer Lopez) falls in love with a charismatic and wealthy contractor named Mitch (Billy Campbell). Things seem to be going well for Slim, they have a nice house, a loving relationship, and a baby girl named Gracie (Tessa Allen), then things go sour. Slim finds out that Mitch has been cheating on her, and decides to address the issue. This does nothing except awaken the abusive beast that has been hidden inside of Mitch. Slim, intolerable of his behavior decides to take Gracie and flee to Michigan. However, little does Slim know that Mitch is an obsessive stalker and her life will never be the same. Tired of living in fear and danger, Slim decides to fight back in what becomes a suspenseful and crowd-pleasing ending.<br /><br />This was a really thrilling film.  I've heard a lot of negative comments about it but I think it was fantastic.",
        "category": "Unknown"
    },
    {
        "rating": 1,
        "parent_asin": "B00006HAWN",
        "timestamp": "2020-07-21 00:36:37.296",
        "review": "Defective product. Defective product 😢",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2017-09-29 18:37:46.739",
        "review": "Five Stars. I really love this movie. Great kick a** chick flick",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2016-11-03 00:35:23.000",
        "review": "Five Stars. Thanks!",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2017-10-04 04:51:38.684",
        "review": "A Great Movie. Sadly, A Must Buy for All of Us (Adults)<br />Great Acting & Story",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2016-11-07 15:51:42.000",
        "review": "Great movie for your collection. Excellent movie!",
        "category": "Unknown"
    },
    {
        "rating": 2,
        "parent_asin": "B00006HAWN",
        "timestamp": "2003-07-31 18:13:13.000",
        "review": "it's all a horrible mistake. My parents rented this dvd, and told me it actually was pretty good (though you'd think by now I would have learned my lesson about trusting their judgement on film), so I figured I'd check it out. That was a horrible mistake. Somebody casted Jennifer Lopez as the lead role. That was a horrible mistake. I suppose I should have kept in mind that Nicholas Kazan, writer of Bicentennial Man wrote the script, both of which were horrible mistakes. Three great actors, Juliette Lewis, Dan Futterman and Bill Cobbs were in this film--a horrible mistake on their part. And while this wasn't the best movie for Noah Wylie to take a part in, he did a wonderful job. He played a villainous role, one that is so unlike what he usually plays, and he did it well. Very creepy. Not a horrible mistake to take a role, just a horrible mistake that the role was in this movie. It's predictable and the only outstanding thing about this film is that it is, you guessed it, all a horrible mistake.",
        "category": "Unknown"
    },
    {
        "rating": 3,
        "parent_asin": "B00006HAWN",
        "timestamp": "2006-10-08 00:15:49.000",
        "review": "Starts off strong... ... and begins to fizzle toward the end.<br /><br />\"Slim\" is a waitress in a diner and falls victim to the conning ways of a charming snake, only to be rescued by a charming snake in sheeps clothing. Well, she ends up marrying the snake who rescues her and has several years worth of blissful ignorance, until she discovers the snake is having an affair. When she confronts him, the once mild mannered husband and father turns into a raving loon. Okay, so we are giving a small glimpse into his character when he threatens the old man to buy his house, but short of that, we have no clue until at least 4 or 5 years down the road that this guy is a real jerk - and abusive to boot.<br /><br />That's the first place where I think the movie kind of takes a bad turn.<br /><br />Next, we watch a lot of implausible scenes where none of the characters do anything that they should in the situation given at the time. While I liked the movie in general, I found myself saying out loud several times, \"Oh, that's just stupid. No one would ever do that!\" or \"What the heck was she thinking? That's not what someoen would really do!\"<br /><br />In the end, the last scene, the retribution and redemption scene, is cheesy and WAY over the top. I was disappointed with the ending, and also disappointed that the loose end with Slim's real father was never tied up for us. She left him with, \"Not now, because it wouldn't be sincere, but at some point, when this is over, you need to admit I'm your kid.\" (or something like that)... and he never did. (shrug)<br /><br />Noah Wiley, whom I usually like, played a part that I believe was beneath him and I was disappointed with his performance in it as well. Jennifer Lopez, given the role and the story line itself, did a great job with her character, and her daughter in the movie, Gracie, was adorable.<br /><br />All in all, I enjoyed the movie, but to call it a legitimate thriller is pushing it a bit, yet I wouldn't go quite so far as to say it was B grade either. Somewhere between Good and Cheesy, it's worth a night on the couch with a bowl of popcorn, if you have nothing better to do.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2010-01-02 20:37:07.000",
        "review": "Enough. Working class waitress Slim finds her life transformed when she marries wealthy contractor Mitch. She settles into an idyllic suburban life and seems to have everything she wants: loving husband, beautiful home, and Gracie, an adorable 5-year-old daughter. Her dream is shattered when she discovers her husband is anything but perfect. His abusive behavior forces her to go on the run, eluding an increasingly obsessive Mitch and his lethal henchmen. When, despite Slim's efforts to make a new life, Mitch finds her and threatens her again, she puts Gracie in safe keeping, toughens herself mentally and physically and sets out to prove to Mitch she's had enough. The intense chemistry between the leading actors, really makes this movie work. The message in this movie, is that everyone  has a limit.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2013-05-28 20:52:15.000",
        "review": "Good Movie. Very dramatic, classic J-Lo underdog situation but a very good movie about a wife who is beaten by her husband and attempts to run away with their child. Thrilling at some parts, emotional at others. I'd recommend it particularly to women who like the idea of female empowerment.",
        "category": "Unknown"
    },
    {
        "rating": 4,
        "parent_asin": "B00006HAWN",
        "timestamp": "2003-04-22 14:10:45.000",
        "review": "Incredible!!! I don't understand why so many critics panned this film starring the ubiquitous Jennifer Lopez, but I rather enjoyed the film.<br />\"Enough\" is a film about a woman who marries what she thinks is the perfect man, but who turns out to be a nightmare. He cheats on her and throws it in her face, and he also is abusive. Jennifer Lopez's main concern is protecting her daughter from all of the pain and anguish that her husband has put into their lives.<br />This movie is filled with a lot of suspense and jumps, which reminds me of a similar film, \"Sleeping With the Enemy.\"<br />The climactic scene at the end where Jennifer Lopez's character finally gives her husband what he deserves will have you cheering in your seats. If nothing else, this film can show people, especially women, that no matter how small or weak you are, you can still protect yourself and the lives of your children from anyone who tries to hurt them.<br />Watch this movie!",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2013-08-22 01:34:20.000",
        "review": "Great thriller. I have always watched this movie when I come across it on TV.  So I looked and this was a great price.  It is a great thriller.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2012-11-24 08:01:28.000",
        "review": "Woman powering movie. This movie is true for a lot of woman but those woman need to learn the techniques that she does to take back control of their lives.",
        "category": "Unknown"
    },
    {
        "rating": 2,
        "parent_asin": "B00006HAWN",
        "timestamp": "2019-10-20 01:16:51.531",
        "review": "Lame, dull. I'm surprised at the high ratings.  Convinced me to buy what is a pretty dull movie.  I guess the reviewers were all J-Lo fans.  Sleeping With the Enemy is similar and a million times better.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2003-11-11 20:13:28.000",
        "review": "Way to go Slim. Jennifer in this movie reminds me of my mother in a way and it just touch home when I saw this movie. I have to say my mother would of love to see this movie and she would tell me that Jen is great in this movie. I cry only because it touch home but Jen really out did herself in this movie. I love this movie and any mother and child should see this movie together.",
        "category": "Unknown"
    },
    {
        "rating": 4,
        "parent_asin": "B00006HAWN",
        "timestamp": "2008-04-02 16:42:57.000",
        "review": "A great crowd pleaseing movie that is better than what I thought it would be. When I first the trailer for Enough I thought the film might be a fake Sleeping With The Enemy in retrospec the film is that but Enough is more of a crowd pleasing film than anything. Jennifer Lopez carries the movie as Slim an abused wife who decides to fight back. Lopez gives one of her best performances since The Cell. Micheal Apted shows J-LO's beauty as a sweet innocent waitress, then a loving/battered housewife to a woman who has had Enough . Billy Campbell gives one of the best villians performances of the year as the husband and Noah Wyle is great as a supporting villian. Juillete Lewis, Dan Futtermen and Tessa Allen as Slim's daughter all give good performances also. Don't get me wrong the film is no Oscar picture but it sets out to please a crowd and that what it does. I give it *** out of ****.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2019-03-12 17:14:00.514",
        "review": "tough gal. it was very entertaining",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2019-05-03 21:22:52.229",
        "review": "excelent. good action, unexpected revenge and payment",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2016-07-25 20:06:31.000",
        "review": "Very suspenseful. Jennifer Lopez is one tough mommy.",
        "category": "Unknown"
    },
    {
        "rating": 4,
        "parent_asin": "B00006HAWN",
        "timestamp": "2018-07-28 23:55:50.219",
        "review": "Four Stars. Good movie.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2018-07-27 10:11:13.021",
        "review": "Five Stars. Love Jennifer Lopez. Great in this movie.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2014-10-07 02:02:00.000",
        "review": "Five Stars. love jennifer!!! super condition",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2020-12-04 19:14:49.434",
        "review": "Enough. I am a big Aimee Mann fan and I wish this movie had a soundtrack.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2016-03-02 12:31:03.000",
        "review": "Must watch for all women. LOVED IT, LOVE IT. must watch",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2016-09-14 23:46:07.000",
        "review": "Five Stars. Great movie!",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2016-09-17 21:48:10.000",
        "review": "bought for a friend. bought for a friend",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2015-01-14 18:10:14.000",
        "review": "EVERY WOMAN SHOULD BUY THIS AND WATCH IT!!! GREAT MOVIE!!!<br />EXCELLENT MOVIE!!!",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2016-02-15 03:41:11.000",
        "review": "I Loved the Movie!! WOW! What a movie! Good condition, quick delivery and I love the movie! I watch it often. It's as good as Sleeping with the Enemy movie!!! Thanks so much!",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2014-01-07 16:31:52.000",
        "review": "review above by Lisa. Ive been looking for this movie forever. I love it. This is a must have in your collection or your just plain boring. Action not words. Thank you!!!!!",
        "category": "Unknown"
    },
    {
        "rating": 1,
        "parent_asin": "B00006HAWN",
        "timestamp": "2005-09-11 23:05:25.000",
        "review": "Slumming it. I thought \"Enough\" would be terrible, but then I saw that Michael Apted and Nicholas Kazan were director and writer respectively. So, I gave it s chance. After all, Apted was responsible for \"Always Outnumbered\" and \"The World is Not Enough\" recently and I thought that if he could combine the melancholy of \"Always outnumbered\" with the action of \"The World is not Enough\" we might have a decent film on our hands. Jennifer Lopez also proved she had dramatic acting ability in \"The Cell.\" Wow, what a waste of all involved. All of them seem to be slumming it. \"Sleeping with the Enemy\" at least had a more haunting villain and when he just wouldn't die in the film's finale it was ridiculous but heart pounding. I much preferred its finale to \"Enough's\" in which Lopez becomes a female ninja. Elia Kazan must be spinning in his grave.",
        "category": "Unknown"
    },
    {
        "rating": 1,
        "parent_asin": "B00006HAWN",
        "timestamp": "2019-07-19 06:02:22.823",
        "review": "No comment. It doesn't  play. It says no disc. I will come back and revise this IF there is a satisfactory remedy.. I'll give the details.",
        "category": "Unknown"
    },
    {
        "rating": 2,
        "parent_asin": "B00006HAWN",
        "timestamp": "2018-05-24 00:10:28.888",
        "review": "What a Waste! I thought I'd be generous & rate it two stars.<br />There are numerous movies that deal with domestic violence.  Many of them are good.  This one is a waste of 2 hours that you'll never get back.  The lines are incredibly asinine - from all the actors, even the small child who plays the couple's daughter.  The storyline is equally silly, especially the final scenes where the wife (played by Jennifer Lopez) breaks into her husband's house & challenges him to a physical fight.  Ms. Lopez would do well to stick to singing; her acting (at least in this project) was as lame as the writing & casting.<br />The title....&#34;Enough,&#34; is appropriate; we've had enough of poorly-done movies.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2020-06-30 02:07:37.126",
        "review": "Good. Good move",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2019-06-27 20:31:14.800",
        "review": "Good lessons to be learned. Good movie",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2007-12-27 19:40:48.000",
        "review": "*Very Good Movie!*. I really liked this movie.It shows that a person can only put up with so much.You have to stand up for yourself.Be strong and you will win.A must see for anyone who has tolerated physical abuse.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2014-08-21 19:10:06.000",
        "review": "Great Movie. This is a great movie for all women to watch.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2016-04-09 05:08:38.000",
        "review": "Never Enough of Enough... The only Jennifer Lopez movie that was ever worth seeing. One of my favorites.",
        "category": "Unknown"
    },
    {
        "rating": 4,
        "parent_asin": "B00006HAWN",
        "timestamp": "2016-07-25 19:43:16.000",
        "review": "Four Stars. scary movie......too close to real life.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2016-03-29 05:06:49.000",
        "review": "Enough. Hi! Love this movie.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2003-04-18 10:34:52.000",
        "review": "Wonderful actress. I'm giving this movie 5 stars just for Jennifer Lopez's performance. The movie is way too unbelievable. She goes from a normal woman to super ninja in less than a month. But with Jennifer behind the wheel everything is forgiven. In my opinion, she is a far greater actress than singer. Her true calling is on film. She's a lot like Sandra Bullock. Even if the movie is terrible the one thing you like is her. I'll go see any Jennifer Lopez movie.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2018-02-10 19:11:57.516",
        "review": "something that will inspire you to stand up for yourself. a movie that shows just how far a mother will go to protect herself and her child against an abusive husband",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2021-03-27 00:39:05.859",
        "review": "Love it. Excellent",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2020-05-23 12:09:46.177",
        "review": "Have to buy this movie awesome. Awesome movie really must see",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2019-09-25 23:37:03.694",
        "review": "THIS MOVIE PROVES WOMEN ARE TOUGH!!!  AND VIEWING IT ONCE IS NOT ENOUGH!!! \"ENOUGH\" (2002) This is an exciting and meaningful movie that everyone should see. For women, it's a powerful and highly motivational reminder that even one incident of physical and emotional abuse is NOT acceptable... especially by a spouse who is supposed to be a helpmate, not an abuser. For men, this movie is a vivid object lesson in how NOT to behave. And it visually reinforces the self-destructive result of such abusive behavior.<br /><br />J-Lo stars as Slim, a waitress who marries her hero, Mitch (Billy Campbell). But several years and a daughter later, Slim is devastated to discover that her hero and father of her child is a cheating and abusive zero. She tries to leave, but the misogynist-psycho husband continues to brutalize, and virtually enslaves her.<br /><br />When the police are unable to offer her protection from further abuse, Slim hires a trainer and takes a crash course in basic kickboxing & defensive maneuvers. A breathtaking car chase and Slim's final confrontation with Mitch are alone worth the price of admission. This suspenseful and well-directed thriller by Michael Apted will leave you feeling a new respect for the not-so-weaker sex.<br /><br />J-lo is supported by Juliette Lewis (Cape Fear) as Slim's best friend Ginny, an ex-boyfriend Joe (Dan Futterman); and Slim's philandering estranged father played by the legendary charismatic tough guy Fred Ward (Tremors).<br /><br />TRIVIA: The movie \"Enough\" had a budget of $38 million. And it grossed over $39 million in just the first week, showing in 2623 theaters across the country.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2010-09-25 20:52:47.000",
        "review": "Prompt service. Amazon is very prompt with their delivery of products. Also the condition of product is good.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2015-08-19 21:58:45.000",
        "review": "Five Stars. Love this movie. JLo is great",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2015-02-12 23:27:07.000",
        "review": "great movie. jenn lopez, is excellent...good for her foghting, back...there is to much abuse, in this world",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2017-08-07 17:40:21.407",
        "review": "Enough. Enjoyed the movie.",
        "category": "Unknown"
    },
    {
        "rating": 1,
        "parent_asin": "B00006HAWN",
        "timestamp": "2003-01-15 20:00:21.000",
        "review": "Implausible to its core. Jennifer Lopez, in spite of what her detractors say, is capable of giving a good, skilled performance in a good movie. For those who don't believe me, look at her work in Steven Soderbergh's \"Out of Sight.\" It was layered, funny, sexy, intelligent and daring. Since \"Out of Sight,\" though, Lopez has yet to make a movie as good or give a performance as good. Onscreen, even in a weak film, she can be charming, as she was in \"Maid in Manhattan\" or \"The Wedding Planner,\" or better than her script, as she was in \"Angel Eyes\" or \"The Cell.\"<br />\"Enough,\" though, is her worst performance and worst film. When I saw this in the theater, having read some bad reviews, I found I could only sit through half of it before deciding that I'd wasted enough of my time. It was awful, offensive, scary, implausible and badly written.<br />Lopez stars as Slim, a waitress swept off her feet by Mitch, a rich and charming man who always gets what he wants. Years into their marriage and long after the daughter they've conceived has grown into a precocious, annoying little movie child, Slim finds out just how far Mitch will go to get his way. Suddenly, though she's known him for years and never had a problem with him, his character turns from a prince into a psychotic, abusive monster. This happens in marriages, I know, but I doubt it happens this way.<br />Campbell plays Mitch as a looped, inhuman monster. His character isn't to be believed. Neither is Lopez's. Saddled with an undefined character with an unexplained first name, you never, ever feel anything for her.<br />... I walked out of the movie because it didn't make any sense and I wasn't going to wait around for some violence-splattered, who-cares-anyway ending.",
        "category": "Unknown"
    },
    {
        "rating": 5,
        "parent_asin": "B00006HAWN",
        "timestamp": "2020-09-30 03:27:48.067",
        "review": "Remember it's a movie but this does happen to people. This is a good movie",
        "category": "Unknown"
    }
]