[
  {
    "rating":5,
    "parent_asin":"B013SLPAGG",
    "timestamp":"2016-06-10 15:36:52.000",
    "review":"Five Stars. Perfect.",
    "category":"Sports_and_Outdoors"
  },
  {
    "rating":5,
    "parent_asin":"B09C5VHWJH",
    "timestamp":"2022-04-05 12:57:58.380",
    "review":"Used for Traveling. I put liquid (creamer for my coffee) in these in my suitcase to travel.  No problems so far!",
    "category":"Industrial_and_Scientific"
  },
  {
    "rating":5,
    "parent_asin":"B01BRVADG6",
    "timestamp":"2021-08-27 19:17:03.316",
    "review":"Healthy looking skin!! Great natural moisture!!!!",
    "category":"All_Beauty"
  },
  {
    "rating":5,
    "parent_asin":"B00MF8012C",
    "timestamp":"2015-11-02 22:18:36.000",
    "review":"Good product. This one works good two I enjoy it every time I use it to take pictures.",
    "category":"Electronics"
  },
  {
    "rating":5,
    "parent_asin":"B007K81L76",
    "timestamp":"2017-07-25 23:19:38.138",
    "review":"Five Stars. was a gift",
    "category":"Unknown"
  },
  {
    "rating":4,
    "parent_asin":"B00DBRA4UK",
    "timestamp":"2015-08-19 17:25:56.000",
    "review":"Four Stars. They are great",
    "category":"Musical_Instruments"
  },
  {
    "rating":4,
    "parent_asin":"B01BRVADG6",
    "timestamp":"2016-05-28 02:22:31.000",
    "review":"Four Stars. Works well and inimical",
    "category":"All_Beauty"
  },
  {
    "rating":5,
    "parent_asin":"B00D7EAA8I",
    "timestamp":"2015-06-27 22:31:49.000",
    "review":"Five Stars. I was slow to be hooked but ended up really enjoying the book",
    "category":"Kindle_Store"
  },
  {
    "rating":5,
    "parent_asin":"B017TRJLC4",
    "timestamp":"2016-03-22 03:13:25.000",
    "review":"Five Stars. Perfect size for everything I need and looks great.  I am going to order more colors.",
    "category":"Amazon_Fashion"
  },
  {
    "rating":5,
    "parent_asin":"B01M71IUZ7",
    "timestamp":"2018-02-13 19:15:13.778",
    "review":"Five Stars. Recommend",
    "category":"Subscription_Boxes"
  },
  {
    "rating":5,
    "parent_asin":"B000DEMJA2",
    "timestamp":"2013-07-28 12:36:35.000",
    "review":"fit's perfectly. I have a 2000 Dodge Ram Quad-Cab, Long-bed, and these fit perfectly.  I had both cables replaced in about 10 minutes.",
    "category":"Automotive"
  },
  {
    "rating":5,
    "parent_asin":"B07PYK5XXK",
    "timestamp":"2019-05-21 11:52:02.140",
    "review":"Very sturdy. Very sturdy. The design is beautiful. I wish they were a little less expensive but they are definitely worth the money.",
    "category":"Home_and_Kitchen"
  },
  {
    "rating":4,
    "parent_asin":"B07STFMW9L",
    "timestamp":"2020-02-04 23:11:00.608",
    "review":"Takes forever to arrive. We live in ohio and this took over 2 weeks to be delivered. All  and all the product is cool and has alot to offer. My 4 year old granddaughter love it. Delivery needs to be planned better.",
    "category":"Subscription_Boxes"
  },
  {
    "rating":5,
    "parent_asin":"B00IAFVQPA",
    "timestamp":"2020-07-20 23:03:14.681",
    "review":"Great gift! Gave to my 93-year-old father and he really loves it!!",
    "category":"Digital_Music"
  },
  {
    "rating":4,
    "parent_asin":"B003TJSNCG",
    "timestamp":"2015-11-05 20:35:30.000",
    "review":"enjoyed watching on a lazy night in. good movie, interesting plot, definitely a &#34;girl movie&#34;",
    "category":"Movies_and_TV"
  },
  {
    "rating":5,
    "parent_asin":"B00FT8ZHHE",
    "timestamp":"2017-02-21 16:28:54.000",
    "review":"great scale! great scale! very accurate and works with the app perfecly",
    "category":"Health_and_Household"
  },
  {
    "rating":5,
    "parent_asin":"B08BC2QC26",
    "timestamp":"2021-02-18 20:59:10.841",
    "review":"Works great. Just what I needed. I have tinnitus and this helps me sleep.",
    "category":"Unknown"
  },
  {
    "rating":5,
    "parent_asin":"B002K3ELVO",
    "timestamp":"2020-10-25 03:15:28.152",
    "review":"Good product. Good specialty product",
    "category":"Tools_and_Home_Improvement"
  },
  {
    "rating":5,
    "parent_asin":"B002PXVYSC",
    "timestamp":"2017-03-08 01:16:23.000",
    "review":"Five Stars. great magazine, great price",
    "category":"Magazine_Subscriptions"
  },
  {
    "rating":2,
    "parent_asin":"B07N9479PQ",
    "timestamp":"2017-08-07 16:18:11.182",
    "review":"... for Otterbox it slips off the phone much too easily. An unusual fail for Otterbox it slips off the phone much too easily.",
    "category":"Cell_Phones_and_Accessories"
  },
  {
    "rating":4,
    "parent_asin":"B01K8WN9NY",
    "timestamp":"2019-12-09 02:35:22.424",
    "review":"Once again a happy Saucony fan. This is the closest style to a previous Saucony I wore for several years. The only adjustment I am making is a change in the depth of the sole near the toe.",
    "category":"Sports_and_Outdoors"
  },
  {
    "rating":5,
    "parent_asin":"B0C99HGBJG",
    "timestamp":"2023-03-28 14:28:37.817",
    "review":"easy to use. It took a few min. to figure it out, but after was very easy. Love how I can now fill my tires up without taking my car to tire places. Found the gas station units were awful to use.",
    "category":"Automotive"
  },
  {
    "rating":5,
    "parent_asin":"B01M71IUZ7",
    "timestamp":"2018-12-16 20:27:59.178",
    "review":"Great variety. I got this for my niece last year.  She loves them and is a great STEM influence.",
    "category":"Subscription_Boxes"
  },
  {
    "rating":5,
    "parent_asin":"006235065X",
    "timestamp":"2015-10-21 13:47:38.000",
    "review":"Five Stars. good read",
    "category":"Books"
  },
  {
    "rating":5,
    "parent_asin":"B09H5HW1M2",
    "timestamp":"2022-08-06 13:51:52.300",
    "review":"Great bag. These are very sturdy. Holds lots of groceries. Can use to carry pretty much anything in. Also folds flat for convenience. Would definitely recommend these.",
    "category":"Home_and_Kitchen"
  },
  {
    "rating":3,
    "parent_asin":"B07HYYY5LD",
    "timestamp":"2018-04-04 13:38:10.355",
    "review":"Not what I expected. Smaller bag then what I expected for the price. Quality product. I would not order it again. I can get a bigger bag locally for less money.",
    "category":"Pet_Supplies"
  },
  {
    "rating":5,
    "parent_asin":"B01BRVADG6",
    "timestamp":"2020-12-19 18:42:35.573",
    "review":"Love this oil. Full body.  Feels great",
    "category":"All_Beauty"
  },
  {
    "rating":5,
    "parent_asin":"B07BB3FK19",
    "timestamp":"2022-08-03 22:08:29.148",
    "review":"Luxurious. This is one of my favorite creams. I think it’s a lot better than the other snail mucin creams. A little goes a really long way for it spreads easily and the texture is very thin yet creamy. So moisturizing but not oily. My skin loves it. It leaves me dewy and has helped my skin look more radiant and clear. I even use it around my eyes sometimes when I don’t feel like doing the whole eye cream thing afterward. It glides so smoothly that it’s perfect for under eye. Try this. You may be surprised. I also use a different brand snail mucin essence which is Devine. Costix I think the brand is. It makes a huge difference as well.",
    "category":"Beauty_and_Personal_Care"
  },
  {
    "rating":3,
    "parent_asin":"B076GNBSM9",
    "timestamp":"2018-03-05 19:26:36.000",
    "review":"Good thing it's a pack of 10! They worked okay but didn't last long and I had to keep changing to a new head. They would ball up so quickly.... but, then, so did the name brand when I bought them, so it's just the way it is I suppose.",
    "category":"Tools_and_Home_Improvement"
  },
  {
    "rating":5,
    "parent_asin":"B07GNX34XV",
    "timestamp":"2020-01-09 15:58:14.258",
    "review":"Smugglers Bounty hits its mark. Great product. Exactly what you want!",
    "category":"Subscription_Boxes"
  },
  {
    "rating":5,
    "parent_asin":"B01CDOWEGS",
    "timestamp":"2017-08-03 19:35:11.089",
    "review":"Great Storage Basket. These storage baskets are just perfect size and weight.  I used them in my entertainment cabinet and they look very custom.  The chrome handle is a nice designer touch.",
    "category":"Home_and_Kitchen"
  },
  {
    "rating":5,
    "parent_asin":"B00XNMDIBU",
    "timestamp":"2023-02-15 18:54:05.728",
    "review":"Oral B brush replacementd. Serm to be lasting as long as Oral B OEM brushes.",
    "category":"Appliances"
  },
  {
    "rating":5,
    "parent_asin":"B007K81L76",
    "timestamp":"2014-07-11 00:02:32.000",
    "review":"Five Stars. Beautiful piece to add to your garden in memory of loved ones.",
    "category":"Unknown"
  },
  {
    "rating":4,
    "parent_asin":"B01M71IUZ7",
    "timestamp":"2017-04-30 01:51:12.000",
    "review":"Great engaging toys for our son. Our 3 year old son now looks forward to the day when his toys arrive. The toys we've received till now have been related to all the things he likes doing (building blocks, drilling bolts, gears) and he's been absolutely loving them. The variety keeps him engaged almost everyday.<br \/><br \/>My only feedback would be to have all the toys in similar standard boxes, that will help us in storage. Right now all toys have been in boxes of different types (cardboard vs plastic) and shapes (flat vs large box vs bucket) that makes it difficult to store.",
    "category":"Subscription_Boxes"
  },
  {
    "rating":5,
    "parent_asin":"B079PSSCYF",
    "timestamp":"2018-12-24 20:40:22.158",
    "review":"Nice fit. Good quality",
    "category":"Automotive"
  },
  {
    "rating":5,
    "parent_asin":"B077ZHW3HN",
    "timestamp":"2018-08-14 17:19:06.720",
    "review":"Great for working out. Comfortable fit.",
    "category":"Clothing_Shoes_and_Jewelry"
  },
  {
    "rating":1,
    "parent_asin":"B07MGJZ2MH",
    "timestamp":"2021-07-04 18:49:20.488",
    "review":"Scandle. The box was full of some really good treats and I can't fault it for that but I've clicked to cancel my sub 5 times now and they keep reactivating it. I was originally only going to temp cancel it until my move was over, but now I feel like I need to change my card just to stop these people harassing me. Not a good company if they keep trying to force people to get a sub. BTW this is not on the sell but overall everything.",
    "category":"Subscription_Boxes"
  },
  {
    "rating":1,
    "parent_asin":"B01M655RA6",
    "timestamp":"2017-02-18 05:36:20.000",
    "review":"One Star. Very flimsy and streaky. They also absorbe liquid foundation very quickly.",
    "category":"All_Beauty"
  },
  {
    "rating":5,
    "parent_asin":"B07STFMW9L",
    "timestamp":"2019-12-23 02:58:51.934",
    "review":"Good. Mis niños disfrutaron mucho esta q es nuestra 1era. Caja",
    "category":"Subscription_Boxes"
  },
  {
    "rating":4,
    "parent_asin":"B07MGJZ2MH",
    "timestamp":"2021-08-07 08:12:38.819",
    "review":"Interesting. I’d say there was a few things that were super good. I don’t think it was worth the price because of how much I personally didn’t enjoy. It was fun to go through and try everything though!",
    "category":"Subscription_Boxes"
  },
  {
    "rating":5,
    "parent_asin":"B01FSGUD34",
    "timestamp":"2017-01-26 03:20:30.000",
    "review":"Five Stars. great",
    "category":"Beauty_and_Personal_Care"
  },
  {
    "rating":5,
    "parent_asin":"B009NVU192",
    "timestamp":"2019-07-01 23:51:17.299",
    "review":"Great series. Sad to have finished this series. I really enjoyed all five books. I will remember the kings more easily because the author made their stories so interesting.",
    "category":"Kindle_Store"
  },
  {
    "rating":5,
    "parent_asin":"B007K81L76",
    "timestamp":"2017-09-03 15:59:29.280",
    "review":"Five Stars. Looks beautiful",
    "category":"Unknown"
  },
  {
    "rating":4,
    "parent_asin":"B007K81L76",
    "timestamp":"2016-10-12 00:02:51.000",
    "review":"Beautifully made. It looks perfect I would not change a thing except if it was just a bit larger.",
    "category":"Unknown"
  },
  {
    "rating":5,
    "parent_asin":"B076N9JT8G",
    "timestamp":"2020-05-08 01:20:18.501",
    "review":"Must have for dino dudes! Such a fun Tyrannosaurus Rex!! My son absolutely loves this toy. We purchased this and the Brachiosaurus from the same collection for his big birthday presents and he's definitely one happy dino dude! This T Rex has the ability to swallow up to 20 miniature dinosaurs (which are not included) and my son has such a blast feeding him all sorts of things just to release his belly and have them all fall out. This T Rex is roughly 3 feet long and makes for one epic play session! Little pricey for what it is but your kid will definitely be happy :).",
    "category":"Toys_and_Games"
  },
  {
    "rating":5,
    "parent_asin":"B08BC2QC26",
    "timestamp":"2021-06-05 01:33:10.641",
    "review":"Multiple settings and timer options. Love the many different settings on this noice machine including several different timer settings.",
    "category":"Unknown"
  },
  {
    "rating":1,
    "parent_asin":"B00F3ID2F4",
    "timestamp":"2016-01-27 06:57:11.000",
    "review":"One Star. didn't work and the wrong item",
    "category":"Electronics"
  },
  {
    "rating":5,
    "parent_asin":"B071KK61L8",
    "timestamp":"2019-04-06 13:24:23.176",
    "review":"Exactly what I thought! Love this hat! Exactly what I expected and very comfortable and cute.",
    "category":"Amazon_Fashion"
  },
  {
    "rating":5,
    "parent_asin":"B008RKY9L6",
    "timestamp":"2014-01-05 07:26:27.000",
    "review":"Updated review. I would have given this app a much higher rating if it weren't for the incessant ads. OMG! They are VERY intrusive and annoying. It almost takes longer to get to the start than to play the game. Much as I would like to play, this is too much of a pain. It's gotta go. Uninstall commencing.<br \/><br \/>Update 011414: I'm happy to report I'm increasing my rating to 5 stars! Thanks to Juliette for her response to my previous review. She gave me an invaluable tip to turn off my wifi or go to airplane mode and VOILA! no more ads. Thanks again Juliette. So get the game, play, enjoy, and be happy. This is the game I was hoping to find.",
    "category":"Unknown"
  },
  {
    "rating":1,
    "parent_asin":"B00PG24QFM",
    "timestamp":"2022-11-20 03:07:13.820",
    "review":"Says account closed. Tried to redeem and check balance on a card we got from this seller on our wedding registry from a guest and the card doesn’t work. So disappointed! Keeps saying “account closed”. It was bought the 10\/28\/2022.",
    "category":"Gift_Cards"
  },
  {
    "rating":5,
    "parent_asin":"B009NVU192",
    "timestamp":"2017-08-25 16:59:36.105",
    "review":"Wonderful series!  Clearly makes the Word of God understandable and helps clarify the history of those tumultuous reigns. Wonder series!  Clearly makes the Word of God more understandable!  Also, the series illustrates the history of these tumultuous reigns and the impact of obedience to God's Word had upon these nations, people and their culture!",
    "category":"Kindle_Store"
  },
  {
    "rating":5,
    "parent_asin":"B01MY00RYY",
    "timestamp":"2017-04-18 15:32:07.000",
    "review":"The Pinnacle Studio 20 Ultimate is easy to use. The Pinnacle Studio  20 Ultimate is easy to use.<br \/>This program is great for beginners and intermediates.<br \/> So get this program and make your family videos and slide shows on DVDs.",
    "category":"Software"
  },
  {
    "rating":5,
    "parent_asin":"B00PFKJFXS",
    "timestamp":"2018-06-14 22:54:10.587",
    "review":"Five Stars. Great product fast shipping",
    "category":"Arts_Crafts_and_Sewing"
  },
  {
    "rating":2,
    "parent_asin":"B0BHP56W6K",
    "timestamp":"2023-03-23 17:39:19.147",
    "review":"Incorrect Sizing. Nice finish on them with a smooth comfort fit but the sizing is just wrong on more than half of them. Sizes 8 and 9 are close enough, size 7 is about a 6.5-6.75, size 10 is 10.25, size 11 is about 11.5, and size 12 is about size 13 (image included to show how far out of spec these are). They just get increasing more out of spec the higher the sizes get.",
    "category":"Arts_Crafts_and_Sewing"
  },
  {
    "rating":5,
    "parent_asin":"B00I4OBXWI",
    "timestamp":"2014-08-31 00:54:56.000",
    "review":"Five Stars. Fantastic plasma TV.  Nothing &#34;smart&#34; about it.  Beautiful picture only seen with plasmas.  Love it.",
    "category":"Unknown"
  },
  {
    "rating":5,
    "parent_asin":"B07N9479PQ",
    "timestamp":"2018-07-24 02:09:19.862",
    "review":"I paired it with a good quality screen protector and it seems to be well ... Very cute and i've had it for several months now.  I paired it with a good quality screen protector and it seems to be well protected.",
    "category":"Cell_Phones_and_Accessories"
  },
  {
    "rating":3,
    "parent_asin":"B07Q5GFKMW",
    "timestamp":"2019-10-07 20:05:40.309",
    "review":"Great light, not so great mount. This is a VERY bright, easy to use light.  The aluminum housing is well made and sturdy.  Unfortunately, the mounting bracket does not match the quality of the lamp.  My bike went over when I was unlocking it from a post and the side rail of the mount sheared right off.  I tried to contact the manufacturer to buy a new mount, but never received a reply.  Bottom line, even though it's a great light, if you can't keep it on your bike, it doesn't work.",
    "category":"Sports_and_Outdoors"
  },
  {
    "rating":5,
    "parent_asin":"B0BRN1P315",
    "timestamp":"2023-01-01 15:40:21.043",
    "review":"Works Great. JLB7tech Baby Monitor, 4.3\" Split-Screen Baby Monitor Exactly as described. Came with two camera and monitor has great picture quality. Easy to connect and use.",
    "category":"Baby_Products"
  },
  {
    "rating":1,
    "parent_asin":"B08CXQ6XM7",
    "timestamp":"2021-08-09 21:50:59.561",
    "review":"Cheap, and not NEARLY as desirable to our cats as other models :-(. Very cheap and also unstable - the noise is NOTHING like a mouse - much more like a bird - overall, our 3 rescues like it not at all - our advice is to avoid this one and move on :-(  No remote control included in ours.",
    "category":"Pet_Supplies"
  },
  {
    "rating":4,
    "parent_asin":"B004ZBIJE4",
    "timestamp":"2015-07-29 16:38:44.000",
    "review":"Four Stars. Good",
    "category":"CDs_and_Vinyl"
  },
  {
    "rating":5,
    "parent_asin":"B07XFGRG61",
    "timestamp":"2020-06-12 23:46:44.678",
    "review":"Nice box. Really cute box. My only issue is I bought one for my 4 year old and one for my 7 year old.  Both boxes had the exact same crafts. My 7 year old thought the crafts were to easy.",
    "category":"Subscription_Boxes"
  },
  {
    "rating":5,
    "parent_asin":"B00A8306C6",
    "timestamp":"2019-09-19 16:00:23.635",
    "review":"N. Good",
    "category":"Video_Games"
  },
  {
    "rating":5,
    "parent_asin":"B07PFY13LZ",
    "timestamp":"2020-09-11 00:13:49.721",
    "review":"warm and funny. Very pretty and I bought grey frames to match my bathroom.  I like it makes my bathroom warm and funny",
    "category":"Handmade_Products"
  },
  {
    "rating":5,
    "parent_asin":"B01MY00RYY",
    "timestamp":"2017-07-10 02:50:30.561",
    "review":"Seems good. I have allot to learn with the software.  There seems to be many tools available.  I'm happy.",
    "category":"Software"
  },
  {
    "rating":4,
    "parent_asin":"B00MF8012C",
    "timestamp":"2017-03-28 02:19:23.000",
    "review":"Four Stars. Solid gimbal, tricky to install on my DJI Phantom 2 but works as designed",
    "category":"Electronics"
  },
  {
    "rating":1,
    "parent_asin":"B07QWV8P2L",
    "timestamp":"2020-06-08 03:00:27.924",
    "review":"Clean ingredients but eclectic color selection. Great idea (I’m all for vegan products) but horrible colors that cannot be used daily.",
    "category":"Subscription_Boxes"
  },
  {
    "rating":5,
    "parent_asin":"B07MGJZ2MH",
    "timestamp":"2022-02-19 01:46:48.398",
    "review":"Surprisngly nice. We were pleasantly surprised by the quality of the items we received in the two monthly boxes we have received. My huby is from Japan, and we travel there a lot, and the items which came are specialty snacks from partcular regions of Japan, as advertised. It was fun to try the different ones over several days. I think the price is a bit high, but people have to make money and the items are not your standard snacks in grocery stores. But relative to a box of good chocolates which with shipping costs comes to around $100, this is a good deal for Valentines Day or Birthday gifts, and its more fun to try than a box of differnt chocolates. Recommended.",
    "category":"Subscription_Boxes"
  },
  {
    "rating":3,
    "parent_asin":"B007OBZD4G",
    "timestamp":"2017-01-06 17:10:09.000",
    "review":"Disappointed for not available on dvd. I was a huge fan of this show, although I'm disappointed that it's not available for dvd home release form. I read the reviews on why and will definitely be writing Warner Bros. and CBS to release them on dvd.",
    "category":"Movies_and_TV"
  },
  {
    "rating":5,
    "parent_asin":"B01M655RA6",
    "timestamp":"2017-02-09 19:06:42.000",
    "review":"Five Stars. i like it",
    "category":"All_Beauty"
  },
  {
    "rating":5,
    "parent_asin":"B06XJCDNQW",
    "timestamp":"2017-04-09 02:55:24.000",
    "review":"this was my absolute favorite music to listen to as a child. Having grown up listening to these as a child, I can attest that at age 30, I still sing these songs and know many Bible verses (and references) by heart because of them. Hands down, this was my absolute favorite music to listen to as a child. My 3 siblings all agree....",
    "category":"Digital_Music"
  },
  {
    "rating":5,
    "parent_asin":"B07W4J36C7",
    "timestamp":"2021-02-01 03:56:42.627",
    "review":"Satisfied. Works well. Feels nice on my skin.",
    "category":"Health_and_Personal_Care"
  },
  {
    "rating":5,
    "parent_asin":"B00LI8DTQU",
    "timestamp":"2016-07-25 18:22:41.000",
    "review":"Five Stars. Grandson's love this",
    "category":"Software"
  },
  {
    "rating":5,
    "parent_asin":"B01MSBQB1P",
    "timestamp":"2019-07-15 23:55:51.829",
    "review":"perfect gift. great to give someone when you don't know what else to gift",
    "category":"Gift_Cards"
  },
  {
    "rating":3,
    "parent_asin":"B07BB3FK19",
    "timestamp":"2021-08-03 16:35:11.532",
    "review":"Doesn’t moisturize much. Soaks in quick but leaves skin feeling dry",
    "category":"Beauty_and_Personal_Care"
  },
  {
    "rating":5,
    "parent_asin":"B08GG14D8R",
    "timestamp":"2023-01-04 16:42:26.119",
    "review":"Nails in under 15 minutes! In no pro by any means. I've tried other brands and it took me forever and they were terrible when finished. Yesterday i whipped these nails up in less than 15 minutes. That's, removing old regular polish, filing and removing cuticles and applying this polish in 13 minutes! It's the perfect consistency to stay on your nail and not run on to your skin.  The brush is great. Im in love love love!",
    "category":"Beauty_and_Personal_Care"
  },
  {
    "rating":5,
    "parent_asin":"B00SW18M8Q",
    "timestamp":"2022-07-23 22:55:54.385",
    "review":"Great game. It’s a great game  for younger children.",
    "category":"Software"
  },
  {
    "rating":3,
    "parent_asin":"B003KTN0B4",
    "timestamp":"2010-08-29 11:07:37.000",
    "review":"No other options, so... First of all, the darkening is real but will function.  Its what you have to expect considering the adapter has to adjust the entire screen shuttering pattern.<br \/>Now for the backhanded compliment:<br \/>What is REALLY frustrating to me is that Mitsi created an adapter to get their legacy DLPs to function as a 3D device whenever 3D actually arrives.  I'm an adult, and I can't watch CLOUDY WITH A CHANCE OF MEATBALLS more than once.  Then what?  There is no content.  I don't have directTV, so I might consider that.<br \/>However, I have one of the legacy SAMSUNG 3D NOT-SO-READY televisions.  I bought it and was unable to buy the glasses.  I thought it was just out of stock for awhile.  Nope!  Samsung just abandoned their user base and left all of us in the lurch.  Mitsi, in a bold marketing move, specifically blocked the SAMSUNG televisions from being able to use the adapter.<br \/>I'll buy a 3D television one of these days, but not anytime soon.  Even the glasses (just about all of them) will not work with each other.  The universality of the system is still years away.  Think about having DVDs that work with Sony, another for Panasonic, etc.  Once your set dies, you're screwed.<br \/>-NO CONTENT ON CABLE<br \/>-NO INTERCONNECTIVITY<br \/>-NO CUSTOMER SUPPORT<br \/>If I want 3D, I'll take a walk around the block.",
    "category":"Electronics"
  },
  {
    "rating":5,
    "parent_asin":"B003TJSNCG",
    "timestamp":"2016-03-07 16:09:20.000",
    "review":"Not just a \"chick flick\". We really enjoyed this movie.  Some may think it this a &#34;chick flick&#34;, but my husband seemed to like it, too.",
    "category":"Movies_and_TV"
  },
  {
    "rating":5,
    "parent_asin":"B01N63EFSF",
    "timestamp":"2018-02-28 01:43:38.055",
    "review":"Five Stars. Excellent product !",
    "category":"Amazon_Fashion"
  },
  {
    "rating":5,
    "parent_asin":"B06VX6T3RG",
    "timestamp":"2022-08-02 01:11:11.080",
    "review":"Happy purchase. Husband liked his gift. Plays it often. Toddler dances to it. Good quality. Good sound.",
    "category":"Musical_Instruments"
  },
  {
    "rating":5,
    "parent_asin":"B071ZTDCK6",
    "timestamp":"2019-04-12 19:37:41.913",
    "review":"Great kraft cards. Just what I was looking for.",
    "category":"Office_Products"
  },
  {
    "rating":5,
    "parent_asin":"B00145EVJ6",
    "timestamp":"2016-11-28 22:43:13.000",
    "review":"Would buy again. So far so good, it does what it's suppose to.",
    "category":"Musical_Instruments"
  },
  {
    "rating":5,
    "parent_asin":"B086862MDH",
    "timestamp":"2017-03-01 12:39:45.000",
    "review":"By far the best almond butter I have tried thus far. YUM!!! By far the best almond butter I have tried thus far!!!!  Will definitely purchase again!",
    "category":"Grocery_and_Gourmet_Food"
  },
  {
    "rating":5,
    "parent_asin":"B07C1111S1",
    "timestamp":"2021-04-17 11:04:16.384",
    "review":"Thickness. item was a little thin",
    "category":"Office_Products"
  },
  {
    "rating":1,
    "parent_asin":"B08R75164S",
    "timestamp":"2022-10-31 01:33:27.583",
    "review":"No problem with seller didn’t like product. Very hard to understand instructions, hard to program, and mileage was way off . Returned to Amazon with no problem",
    "category":"Sports_and_Outdoors"
  },
  {
    "rating":4,
    "parent_asin":"B00IAFVQPA",
    "timestamp":"2016-06-22 17:38:13.000",
    "review":"One of best MOR singers ever! Update (6\/24\/16):<br \/>Forgot to mention - was delighted to receive item two days early via AmazonPrime!<br \/>---<br \/>We (and my parents) have always loved Johnny Mathis! He sings like an angel, and this meticulously and beautifully displayed ensemble does justice to his unprecedented career.<br \/>However, like so many other collections, if the 'filler' was removed, a 2-CD package would have been perfect.",
    "category":"Digital_Music"
  },
  {
    "rating":5,
    "parent_asin":"B09W8NHGNB",
    "timestamp":"2022-12-04 03:56:21.742",
    "review":"Very sturdy. Great item would recommend it works great for one hand",
    "category":"Tools_and_Home_Improvement"
  },
  {
    "rating":4,
    "parent_asin":"B01N63EFSF",
    "timestamp":"2020-01-22 06:18:02.071",
    "review":"Good wallet especially for the price! My husband liked this.  We had looked everywhere for him a new wallet & I found the perfect one as a better price.",
    "category":"Amazon_Fashion"
  },
  {
    "rating":5,
    "parent_asin":"B07DK2R31H",
    "timestamp":"2019-04-26 00:27:18.502",
    "review":"Great game! Love it. Fun game! Complex story",
    "category":"Video_Games"
  },
  {
    "rating":5,
    "parent_asin":"B01MSBQB1P",
    "timestamp":"2019-07-07 18:56:16.084",
    "review":"A gift card is easy and smart. Gives my kids money as a gift without the criticism that I get stupid gifts.",
    "category":"Gift_Cards"
  },
  {
    "rating":5,
    "parent_asin":"B07MPSM18Y",
    "timestamp":"2019-07-11 03:29:03.591",
    "review":"Great Product. Great free app that I enjoy.",
    "category":"Software"
  },
  {
    "rating":5,
    "parent_asin":"B08QS6PKW8",
    "timestamp":"2022-06-05 19:03:34.552",
    "review":"Da Bomb!! Not sure I’d “gift them” but these little things are Da Bomb for Taco Tuesday!! I haven’t served margaritas in them yet but I’m sure they could handle it. 😂",
    "category":"Home_and_Kitchen"
  },
  {
    "rating":5,
    "parent_asin":"B0000088C1",
    "timestamp":"2014-08-12 12:29:15.000",
    "review":"Perfect. On time.  Perfect.",
    "category":"CDs_and_Vinyl"
  },
  {
    "rating":5,
    "parent_asin":"B01MSBQB1P",
    "timestamp":"2019-06-29 17:05:11.130",
    "review":"Great choice for flexibility in spending. Choosing a visa gift card allows the recipient the flexibility of getting almost anything anywhere. This card was bought for my granddaughter who genuinely appreciated it.  The looks of it was very nice too with a lot of gold sparkly on it .",
    "category":"Gift_Cards"
  },
  {
    "rating":5,
    "parent_asin":"B00NQ944NQ",
    "timestamp":"2018-12-01 04:25:00.799",
    "review":"never disappointed. hes always so happy",
    "category":"Unknown"
  },
  {
    "rating":5,
    "parent_asin":"B00IAFVQPA",
    "timestamp":"2019-06-19 04:24:00.378",
    "review":"Love his songs and voice. Great cd",
    "category":"Digital_Music"
  },
  {
    "rating":2,
    "parent_asin":"B0072AG5K0",
    "timestamp":"2016-09-19 07:40:13.000",
    "review":"Did not work with PB platform bed. It's a nice product that just didn't work for us.  We purchased two hoping to connect them to each other on either sides of a full size mattress on a Pottery Barn platform bed.  The metal bars are awkard underneath the mattress, and you can't fold down the sides since the platform bed has a lip to prevent the mattress from sliding off onto the floor.  We had to return this, and also found that it's very difficult to pack this back into the box.  The vendor's youtube video makes it look so mich easier than it really is to manipulate this product.",
    "category":"Unknown"
  },
  {
    "rating":5,
    "parent_asin":"B01FERR5HY",
    "timestamp":"2017-01-02 21:14:09.000",
    "review":"Cute bear with value!:). Nice deal, thx Amazon!",
    "category":"Gift_Cards"
  },
  {
    "rating":5,
    "parent_asin":"B079PSSCYF",
    "timestamp":"2021-06-13 06:06:41.929",
    "review":"Exactly what I needed. Exactly what I needed to hardwire my escort radar detector to my car.",
    "category":"Automotive"
  },
  {
    "rating":5,
    "parent_asin":"B00PFKJFXS",
    "timestamp":"2016-03-09 15:42:27.000",
    "review":"Five Stars. The color is amazing!",
    "category":"Arts_Crafts_and_Sewing"
  },
  {
    "rating":1,
    "parent_asin":"B07414X6SL",
    "timestamp":"2018-06-26 19:42:27.995",
    "review":"Too Small for Glasses. Too small for glasses. OK size for microscopes and other small lenses.<br \/><br \/>Not sure why a wet wipe and then a dry wipe??? A dry wipe is just looking for scratches.",
    "category":"Health_and_Personal_Care"
  },
  {
    "rating":5,
    "parent_asin":"B00SW18M8Q",
    "timestamp":"2017-09-12 13:38:36.377",
    "review":"Five Stars. favorite",
    "category":"Software"
  },
  {
    "rating":5,
    "parent_asin":"B009NVU192",
    "timestamp":"2015-05-01 18:54:30.000",
    "review":"Five Stars. Scripturally sound.",
    "category":"Kindle_Store"
  },
  {
    "rating":3,
    "parent_asin":"B0009OAGUG",
    "timestamp":"2017-09-11 04:23:30.172",
    "review":"Not as good as before. I like it but it seems less potent than it used to . must be watered down.",
    "category":"Unknown"
  },
  {
    "rating":1,
    "parent_asin":"B002PXVYVE",
    "timestamp":"2022-03-12 18:44:24.443",
    "review":"Cheap material, confusing articles and ads. This magazine is mostly ads. The material is cheap. The articles are confusing. Places are not clearly identified, so I find myself searching for \"where?\" a lot. They cover stupid idea places -- vacay in Rwanda anyone?",
    "category":"Magazine_Subscriptions"
  },
  {
    "rating":5,
    "parent_asin":"B00WHPXX0U",
    "timestamp":"2016-05-21 15:34:17.000",
    "review":"STUDENTS LOVE. PUT UP IN MY WORK OFFICE\/CLASSROOM---, STUDENTS LOVE IT",
    "category":"Arts_Crafts_and_Sewing"
  },
  {
    "rating":5,
    "parent_asin":"B00PG23QFI",
    "timestamp":"2020-01-15 01:45:45.858",
    "review":"Love this gift card!! I got this gift card for my husband for Christmas. We both enjoy eating at Longhorn Restaurant. This makes for a nice gift as there are six restaurants to choose from.",
    "category":"Gift_Cards"
  },
  {
    "rating":5,
    "parent_asin":"B00XNMDIBU",
    "timestamp":"2020-08-06 16:32:59.849",
    "review":"Value. Price, alot less than original  LG filter",
    "category":"Appliances"
  },
  {
    "rating":5,
    "parent_asin":"B01MSBQB1P",
    "timestamp":"2021-05-22 02:18:47.120",
    "review":"Easy. Needed a gift and couldn’t get out. It was great to order online.",
    "category":"Gift_Cards"
  },
  {
    "rating":5,
    "parent_asin":"B09W25LTPT",
    "timestamp":"2022-07-16 00:56:52.341",
    "review":"The Corkie colorful pepper grinders. I saw these listed, really liked the \"cute\" factor of the multicolored LEDs, and gave them a shot.  Ha!, they really are pretty cute.  The multicolor blinky lights go in sequence around this translucent lip, and yep, there are 4 LEDs to show the grinder's charge level.  I imagine the lights are more a novelty than a necessity, but it's fun to look at, and my cat is fascinated by the lights.  :D<br \/><br \/>The motor seems powerful enough, after loading up with those fancy multicolored peppercorns (black, red, brownish, tan, etc.) to match the festive colors.  Do I need the lights?  No.  Are they fun?  Yeah, why not?  :D<br \/><br \/>Anyway, you can adjust the grind from fine to chunky.  For eggs, I like chunky, to get little bursts of pepper flavor.<br \/><br \/>After charging them with the included usb cables, I got to work.  I tried both \"manual\" and \"automatic\" modes, but the manual doesn't describe how to select them.  It's pretty easy, though.  When pointed upward, turning it on gets the blinkies going and it's in automatic mode.  Tilt it to squeeze out pepper, and it does.  Tilt it back upright, and it turns off.  I haven't timed it, but after a while, it snaps out of automatic mode and turns back off into standby.  For manual mode, just point it down at the food, press to turn on, press to turn off.  Simple!<br \/><br \/>One thing I confess that I like most about them is that the \"output\" is on top and not the bottom.  I hate hate hate when peppermills have the output on the bottom, because it can be placed on a table or countertop that's wet, greasy, dirty, etc., and potentially all that dirt sticks to where the pepper comes out.  The grinders I have now, I have \"coasters\" that they sit in, basically just lids from used jars of peanut-butter and the like (cup-shaped also catches loose pepper).  At least that on these, the output is on top, so it stays clean.  It's frankly the first grinder I have which has that feature.<br \/><br \/>So absolutely, I like these.  :D",
    "category":"Home_and_Kitchen"
  },
  {
    "rating":5,
    "parent_asin":"B01ALFDMFS",
    "timestamp":"2016-07-16 17:27:14.000",
    "review":"The design is excellent. The design is excellent and the thought of making the ports accessible is great. The case fits my Hero3 perfectly.",
    "category":"Electronics"
  },
  {
    "rating":5,
    "parent_asin":"B01FSGUD34",
    "timestamp":"2017-02-22 11:23:59.000",
    "review":"Five Stars. was a gift for someone who loves it.",
    "category":"Beauty_and_Personal_Care"
  },
  {
    "rating":4,
    "parent_asin":"B07N9479PQ",
    "timestamp":"2018-10-20 12:20:23.810",
    "review":"Nice case for phone. The buttons are hard to push.  Other than that I’m happy with the quality",
    "category":"Cell_Phones_and_Accessories"
  },
  {
    "rating":5,
    "parent_asin":"B071KK61L8",
    "timestamp":"2017-08-19 13:38:21.882",
    "review":"Great Fit!! Great fit. Durable material but still comfortable. Where it all day and it doesn't cause any discomfort or those weird red lines like other hats. It has the clamp style fastener in the back instead of the button which I think is more comfortable and holds the size better. All around great product. I wear mine every day.[[ASIN:B071KK61L8 You're Too Close Embroidered Dad Hat 100% Cotton Baseball Cap For Men And Women]]",
    "category":"Amazon_Fashion"
  },
  {
    "rating":5,
    "parent_asin":"B076N9JT8G",
    "timestamp":"2020-04-22 21:26:58.848",
    "review":"Totally Awesome T-Rex! This Dino is huge! My son loves it! The T-Rex obviously isn’t fully stable when assembled simply b\/c of his size, but when positioned correctly he will stand upright by himself. With all play with him he has to be supported. But this is a cool toy!! I’d buy again!<br \/>Tip: When assembling him don’t be afraid to hit him pretty hard to lock his leg in. If you don’t hit it hard enough his leg will keep coming off when playing.",
    "category":"Toys_and_Games"
  },
  {
    "rating":4,
    "parent_asin":"B07Y9WTGKP",
    "timestamp":"2021-12-17 15:30:45.789",
    "review":"Fun statement. Fun piece",
    "category":"Clothing_Shoes_and_Jewelry"
  },
  {
    "rating":1,
    "parent_asin":"B0973DX559",
    "timestamp":"2023-01-06 19:21:04.144",
    "review":"Squirrels eat it like candy. My squirrels must be from south of the border because they were not deterred by either of 2 brnds of hot sauce I bought. I have to use rubber gloves just to handle the seed after using this but squirrels treat it like ketchup on a hot dog.",
    "category":"Patio_Lawn_and_Garden"
  },
  {
    "rating":2,
    "parent_asin":"B007F1YIVO",
    "timestamp":"2022-05-06 14:59:14.666",
    "review":"Flimsy. Product is flimsy not good to put gas in car spills too much",
    "category":"Industrial_and_Scientific"
  },
  {
    "rating":5,
    "parent_asin":"B0C1RQPMS4",
    "timestamp":"2017-11-06 04:31:04.527",
    "review":"Five Stars. These are great! Best $20 ever!",
    "category":"Baby_Products"
  },
  {
    "rating":4,
    "parent_asin":"B01E0QKM7U",
    "timestamp":"2017-01-25 11:02:55.000",
    "review":"Four Stars. Very easy to install and so far it works",
    "category":"Electronics"
  },
  {
    "rating":4,
    "parent_asin":"B00DBRA4UK",
    "timestamp":"2011-11-13 08:59:07.000",
    "review":"Solid midtones, but lacks range. Disclaimer: I do not claim to be an audiophile or expert on audio<br \/><br \/>Pros:<br \/>Excellent midrange - The midtones on these sound much warmer and more fluid than on any pair of headphones I've owned.<br \/>Comfortable - one of the only pairs of headphones I've owned that I can wear for hours on end without any discomfort<br \/>Detachable cord - extremely handy as I tend to take this with me a lot, and built-in cords inevitably start to fray after extended traveling, so having a detachable cord is extremely useful for me.<br \/><br \/>Cons:<br \/>Very poor range - these tend to cut off the high end of the audio range, and there's no real bass to speak of<br \/>The cord it comes with does not have a 3.5mm connector",
    "category":"Musical_Instruments"
  },
  {
    "rating":5,
    "parent_asin":"B01M71IUZ7",
    "timestamp":"2019-08-01 13:27:00.484",
    "review":"Great deal! I did this for five months for my son (who was then 3).  It was an amazing deal.  Every toy was at least 20-30% off and my son still plays with them all (I stopped subscribing in January due to the influx in toys due to Christmas).  I highly recommend this!  The toys were so high quality and fun for both of us.",
    "category":"Subscription_Boxes"
  },
  {
    "rating":5,
    "parent_asin":"B00XNMDIBU",
    "timestamp":"2022-12-15 11:00:38.368",
    "review":"Works as advertised. Good quality for the price.",
    "category":"Appliances"
  },
  {
    "rating":5,
    "parent_asin":"B001NIGB6U",
    "timestamp":"2016-10-28 14:24:07.000",
    "review":"Five Stars. Great OEM replacement toner cartridge for our HP printer. Arrived on time and works as advertised.",
    "category":"Office_Products"
  },
  {
    "rating":5,
    "parent_asin":"B07MGJZ2MH",
    "timestamp":"2021-06-17 12:46:20.601",
    "review":"Pleased. So far have only tried the initial subscription box. I was very pleased.  The snacks tended to be of a higher quality and diversity than you get in typical Japanese snack boxes which tend to be mostly kiddie snacks.  It is a bit on the pricey side, but if the shipments continue to be of the quality of the initial shipment, I feel it will be worth the price for the exposure to higher quality and somewhat unique products.  Of course the initial subscriber fee went down AFTER I purchased it, but that's life.  Still feel it is a worthwhile purchase based upon initial impressions.  Also do like the in-box guide\/booklet.<br \/><br \/>Update:  Have been a subscriber for just shy of a year and have to say I have really enjoyed the monthly boxes and plan to continue receiving.  I look forward to seeing what arrives each month.  Though I may not like every item in the package, I have also found some items that I have absolutely loved and have even ordered more of them directly from the company.  I find the price worth it, especially considering the variety, quality, and the exposure to new and interesting items.<br \/><br \/>Update: Dec 2022.  Still a customer and still a fan of the product.  They keep providing interesting products that I enjoy.",
    "category":"Subscription_Boxes"
  },
  {
    "rating":5,
    "parent_asin":"B06WVJRB1X",
    "timestamp":"2021-08-13 23:06:59.548",
    "review":"Just what I wanted. Just what I wanted",
    "category":"Office_Products"
  },
  {
    "rating":5,
    "parent_asin":"B0BYPPQ73X",
    "timestamp":"2021-12-27 17:01:56.276",
    "review":"mini but mighty. [[VIDEOID:3dfafae1f4988c69ddfb972c41fe2ce6]] This massage gun is mini but mighty! I've gotten the bigger heavy duty ones and while those are very powerful, I've honestly never used past the second or third speed. Those also get a little too heavy for my little hands to hold, especially if using it for more than 5 minutes. This one is just perfect in terms of size and weight. This one is not too bulky and I've brought it with me on a recent weekend getaway - did not take up too much luggage room at all. It has all the attachments that you would need (I usually stick to the round foamy ball). I think this one is perfect for women\/girls, or just anyone that cannot hold anything too heavy but still want the benefits of a massage gun. Don't be mistaken though, just because it is a smaller unit does not mean it isn't powerful! There are four speeds to choose from and at the highest speedy, it packs the same powerful punch as those big massage guns. If this is your first massage gun purchase then I highly recommend getting a smaller one like this first and if you feel like you need a much more heavy duty one then switch to those - I would start with something like this first though.",
    "category":"Health_and_Household"
  },
  {
    "rating":5,
    "parent_asin":"0312498063",
    "timestamp":"2015-02-16 16:08:13.000",
    "review":"Great gift. Great gift",
    "category":"Books"
  },
  {
    "rating":5,
    "parent_asin":"B004ZBIJE4",
    "timestamp":"2018-08-02 02:18:15.069",
    "review":"Fantastic Album. LOVE, LOVE, LOVES IT!!  I recommend this album. All great songs, but then again it's Eric Church!",
    "category":"CDs_and_Vinyl"
  },
  {
    "rating":4,
    "parent_asin":"B0BNMYW1VF",
    "timestamp":"2023-03-21 19:18:34.999",
    "review":"Unique looking accent light. I'm using this on a bookshelf in a windowless hallway and it does a nice job providing accent light in a location where we don't have an outlet. It's a nice looking lamp made with a unique design and made with solid materials. It's on the heavy side and feels and looks well made. My only complaint about the design is the on\/off touch sensor at the top - it's white plastic and lights up when the light is on which in my opinion disrupts the overall design of the lamp.<br \/><br \/>The lamp doesn't come with much in the way of instructions but I found it intuitive to assemble (screw the top to the base, that's it) and use. Initial charge time is quite long, more than five hours long, so hopefully that translates to long battery life. Keeping the light plugged into an outlet isn't really practical as the charging port is located under the shade of the lamp, not at the base, so a cord would be very visible.<br \/><br \/>The LED color is a soft white and can be dimmed by long pressing the on\/off sensor on the top of the shade. At its highest setting I'd say that the light is still basically and accent light unless you are sitting or working very close to it. I like that I can take this lamp out to the deck for summer entertaining and, assuming it's charged, can be useful during power outages.",
    "category":"Tools_and_Home_Improvement"
  },
  {
    "rating":3,
    "parent_asin":"B01MSBQB1P",
    "timestamp":"2019-01-21 12:10:22.140",
    "review":"Had trouble with every purchase. Not sure why, but had trouble everywhere I used this card. It worked eventually but I used it a total of 3 places and not a single transaction was straightforward.  I had to return an item that I'd initially purchased with this card and it took about 3 days for the return to post back to the card.",
    "category":"Gift_Cards"
  },
  {
    "rating":5,
    "parent_asin":"B01ID3UC1M",
    "timestamp":"2017-01-02 00:31:56.000",
    "review":"night driving glasses. The very best night driving glasses that I've found that I really liked",
    "category":"Amazon_Fashion"
  },
  {
    "rating":5,
    "parent_asin":"B01B6XFIJ2",
    "timestamp":"2017-08-22 21:30:12.402",
    "review":"Five Stars. Great action film",
    "category":"Movies_and_TV"
  },
  {
    "rating":5,
    "parent_asin":"B07SCZCH8P",
    "timestamp":"2020-07-25 08:08:25.386",
    "review":"Cute. Great quality",
    "category":"Appliances"
  },
  {
    "rating":5,
    "parent_asin":"B01N63EFSF",
    "timestamp":"2018-09-21 15:23:38.121",
    "review":"ok. good",
    "category":"Amazon_Fashion"
  },
  {
    "rating":5,
    "parent_asin":"B00MF8012C",
    "timestamp":"2015-09-22 03:04:24.000",
    "review":"... the Gimbal on a Phantom 1 and it woks great with my GoPro 3+. Installed the Gimbal on a Phantom 1 and it woks great with my GoPro 3+. It is much lighter that other gimbals that I have used and seems to be more stable.",
    "category":"Electronics"
  },
  {
    "rating":4,
    "parent_asin":"B01M1490P2",
    "timestamp":"2017-02-12 18:06:52.000",
    "review":"Just what I wanted for the price! Just what I wanted for the price!",
    "category":"Sports_and_Outdoors"
  },
  {
    "rating":4,
    "parent_asin":"0312498063",
    "timestamp":"2014-12-20 19:19:34.000",
    "review":"A Bit Much. Great pictures and plenty of variety...maybe too much?  Maybe just too much for what I was looking for.  So many different kinds of vehicles and names that it kind of numbs you to them.  All the different &#34;trucks&#34; just become &#34;truck&#34; instead of remembering some classics like &#34;fire truck&#34;, &#34;dump truck&#34;.<br \/><br \/>Nevertheless, it is well put together and the images are high quality.  Maybe better suited for the preschooler to 1st grade when considering the variety and differentiation of different vehicle classes.",
    "category":"Books"
  },
  {
    "rating":3,
    "parent_asin":"B01MSBQB1P",
    "timestamp":"2019-01-09 19:21:43.791",
    "review":"Cash vs card. High purchase fee.",
    "category":"Gift_Cards"
  },
  {
    "rating":1,
    "parent_asin":"B01J528VDG",
    "timestamp":"2016-12-05 19:23:52.000",
    "review":"it doesn't do a good job absorbing excess oil and left my complexion looking ... I hoped this would work because I wanted an alternative to blotting papers.  However, it doesn't do a good<br \/>job absorbing excess oil and left my complexion looking dull.  I would not recommend it and will continue<br \/>to use blotting papers for now.",
    "category":"All_Beauty"
  },
  {
    "rating":5,
    "parent_asin":"B01MR306SS",
    "timestamp":"2022-03-12 19:49:47.054",
    "review":"Cheap price for quality. It's awesome. Worth the cash. Thanks",
    "category":"Pet_Supplies"
  },
  {
    "rating":4,
    "parent_asin":"B00D7EAA8I",
    "timestamp":"2014-08-14 02:33:18.000",
    "review":"Recommended read. Interesting characters, plot line and twists.  Kept my interest.  Enjoyed it to the end.  Look forward to reading another Sam Darling mystery.",
    "category":"Kindle_Store"
  },
  {
    "rating":3,
    "parent_asin":"B007K81L76",
    "timestamp":"2014-11-04 17:50:37.000",
    "review":"Three Stars. Wish it had a little better solar light, only last a few hours in the late evening.",
    "category":"Unknown"
  },
  {
    "rating":5,
    "parent_asin":"B00145EVJ6",
    "timestamp":"2018-12-09 11:45:32.114",
    "review":"Nice product. Good workin product",
    "category":"Musical_Instruments"
  },
  {
    "rating":4,
    "parent_asin":"B07Y9WTGKP",
    "timestamp":"2020-08-04 04:30:32.929",
    "review":"Cool hat with a lot of style. This hat is cool and stylish I paired it with a pair of leopard sandals , really great look!",
    "category":"Clothing_Shoes_and_Jewelry"
  },
  {
    "rating":4,
    "parent_asin":"B00VFFYPBE",
    "timestamp":"2016-08-23 12:42:17.000",
    "review":"Four Stars. works as expected.",
    "category":"Unknown"
  },
  {
    "rating":5,
    "parent_asin":"B071ZTDCK6",
    "timestamp":"2021-10-31 17:28:04.028",
    "review":"good buy. good buy",
    "category":"Office_Products"
  },
  {
    "rating":5,
    "parent_asin":"B00XNMDIBU",
    "timestamp":"2023-09-02 14:50:27.343",
    "review":"Works perfect in my LG refrigerator. These filters are a good replacement for the LG OEM filters and less costly.",
    "category":"Appliances"
  },
  {
    "rating":5,
    "parent_asin":"B00HEV1SL8",
    "timestamp":"2014-06-05 12:04:45.000",
    "review":"These mats are a god sent. I have to roll out dough often for meals and these mats makes it so much easier.  The process of rolling is quick and the dough soes not stick to the mat.<br \/><br \/>I also use one of these to line my baking sheet when I  use it to bake.  The mat eliminates the use of cooking spray and does not give my food a greasy feeling or taste.  The food comes right off the mat, even cheese.<br \/><br \/>I am thinking of getting another set.",
    "category":"Unknown"
  },
  {
    "rating":4,
    "parent_asin":"B01HI8V104",
    "timestamp":"2018-10-06 19:20:25.509",
    "review":"Little read. Got it on prime day for .99, probably wouldn't have paid more",
    "category":"Magazine_Subscriptions"
  },
  {
    "rating":5,
    "parent_asin":"B0C46XDVNH",
    "timestamp":"2021-11-19 19:19:04.085",
    "review":"I love these planners. I have used these for many years - just my favorite monthly planner - price is a bit high",
    "category":"Office_Products"
  },
  {
    "rating":5,
    "parent_asin":"B07Y9WTGKP",
    "timestamp":"2020-01-30 22:44:28.065",
    "review":"Love it. So cute definitely worth the price!",
    "category":"Clothing_Shoes_and_Jewelry"
  },
  {
    "rating":5,
    "parent_asin":"B086862MDH",
    "timestamp":"2021-04-19 00:34:54.294",
    "review":"Great Tasting Almond Butter. Everything going for it except the plastic jar.  Glass is so much better!",
    "category":"Grocery_and_Gourmet_Food"
  },
  {
    "rating":5,
    "parent_asin":"B07R92C3HM",
    "timestamp":"2020-09-04 17:27:13.696",
    "review":"that the cats like it. My cats love it.",
    "category":"Unknown"
  },
  {
    "rating":5,
    "parent_asin":"B00J613OHU",
    "timestamp":"2016-08-13 19:09:48.000",
    "review":"Addicted!!! I'm addicted to the Slow Burn series!!!!!  Can't wait to read the next book!  I highly recommend reading them in the series order, though.  You don't necessarily have to, but it REALLY helps build things up if you do.  Fantastic and somewhat unique twist on the genre.",
    "category":"Unknown"
  },
  {
    "rating":5,
    "parent_asin":"B00006HAWN",
    "timestamp":"2012-11-24 08:01:28.000",
    "review":"Woman powering movie. This movie is true for a lot of woman but those woman need to learn the techniques that she does to take back control of their lives.",
    "category":"Unknown"
  },
  {
    "rating":3,
    "parent_asin":"B0B736RP35",
    "timestamp":"2018-11-02 14:53:33.574",
    "review":"It's OK. This coffee is OK.  Nothing to brag about.  It is a little bitter after it starts to cool down.",
    "category":"Grocery_and_Gourmet_Food"
  },
  {
    "rating":3,
    "parent_asin":"B01M655RA6",
    "timestamp":"2017-02-12 05:36:25.000",
    "review":"Ok Product. The brush heads are firm and the bristles are amazingly soft. They do the jobs they need to. How ever it is true what they say, you get what you pay for; the handles are very  fragile  and  feel as though they will break very quickly.",
    "category":"All_Beauty"
  },
  {
    "rating":5,
    "parent_asin":"B000DEMJA2",
    "timestamp":"2013-04-10 18:28:49.000",
    "review":"great replacement. i bought this for my 1999 dodge ram 1500 and it fit perfect and now my tailgate doesnt fall off. seems good quality",
    "category":"Automotive"
  },
  {
    "rating":5,
    "parent_asin":"B01MZ2IYDL",
    "timestamp":"2018-03-26 02:29:33.731",
    "review":"all around  great basic cross trainer. Bought these for my daughter as a basic workout at the gym shoe. She is very pleased with them. Said they offer support and cushion. True to size, looks nice with workout clothes: flattering and not bulky feeling. Good price and value.",
    "category":"Clothing_Shoes_and_Jewelry"
  },
  {
    "rating":5,
    "parent_asin":"B003KTN0B4",
    "timestamp":"2011-05-21 02:06:04.000",
    "review":"Mitsubishi 3D starter Kit. As far as the 3D emitter pkg. I bought there was no problem, this is a good company and service was great and it arrived very quick but I wish I had done more  homework before buying the Mitsubishi. Other Types  of TV (Samsung) comes with everything ready to watch 3D. We bought the TV Jan. 2009 and did not realize you had to buy extra emitter and it was not even developed so we have waited almost a year to  get the emitter and then we found out the new  Blue Ray player had to be 3D so that was another $200.00 dollars down the drain. I will not go back to HH Gregg because I was not advised of all the extra you have to have. It was a 73\" Mitsubishi. . Don't buy a TV that has to have an emitter because there is a lot of garbage to hook everything up to get 3D picture.",
    "category":"Electronics"
  },
  {
    "rating":3,
    "parent_asin":"B07N9479PQ",
    "timestamp":"2017-02-05 16:59:10.000",
    "review":"color is not what I expected,. color is not what I expected, but the case fits well and provides a low level of protection as expected",
    "category":"Cell_Phones_and_Accessories"
  },
  {
    "rating":5,
    "parent_asin":"B0BZTZ3VW8",
    "timestamp":"2020-08-01 15:22:00.783",
    "review":"Bigger than I thought but works beautifully! I bought this so we have a backup in case the power goes out (and I don't have access to our vehicle). I am thrilled with the size AND that it has a handle, making it easier to transport. I tested it on some dead items I had laying around (bluetooth speaker and Kindle) and it took a little bit longer than the electrical plug (which shocked me).",
    "category":"Patio_Lawn_and_Garden"
  },
  {
    "rating":5,
    "parent_asin":"B01M655RA6",
    "timestamp":"2017-02-09 14:33:47.000",
    "review":"Five Stars. Love the brushes and received them very quickly.",
    "category":"All_Beauty"
  },
  {
    "rating":5,
    "parent_asin":"B00F3ID2F4",
    "timestamp":"2015-10-21 16:15:42.000",
    "review":"Great cable. I got this cable so I could reposition a wireless router for better reception and it works great. It has a very thin profile and lays flat. As long as you route it along a wall seam and the color matches, you'll barely notice it and I haven't noticed any speed degrade from using this cable.",
    "category":"Electronics"
  },
  {
    "rating":5,
    "parent_asin":"B086862MDH",
    "timestamp":"2016-08-09 13:10:30.000",
    "review":"Five Stars. Dang good.",
    "category":"Grocery_and_Gourmet_Food"
  },
  {
    "rating":5,
    "parent_asin":"B00XNMDIBU",
    "timestamp":"2023-06-01 11:43:09.887",
    "review":"Works Again. Worked perfectly",
    "category":"Appliances"
  },
  {
    "rating":3,
    "parent_asin":"B07KM6T8GV",
    "timestamp":"2019-11-14 17:19:52.070",
    "review":"First Impressions are just So-So. Received my first box - Shampoo and Conditioner Sample were too small (did not contain enough product for ONE use) for my \"just-past-shoulder-length\" hair.  The facial cleaner lasted a week, the body wash was enough for three showers.  The hand\/body moisturizer lotion was enough for one good application to my legs and arms.  I really liked the consistency of the full size lip gloss, but the color (Berry-Purple) was WAAAAYYY off for me.  I'm a REDHEAD and I use earth tones, corals, melons, terra-cottas and occasionally a plum, but purple?  Oh, no, not for my mouth!  If you're going to send me that color lip gloss, then also put in a sample or two of a coordinating blush so I can see if I would like it.  Think these things through and COORDINATE things, ladies!!!  I'm going to give them a couple more months to see how things go.....but the one thing I do not like is that every company represented in this box is now sending me emails - and two of them are sending emails EVERY day!  This is not a free subscription, I'm paying for it - so I don't like being inundated with emails.  One or two would have been plenty,  links to their websites, etc, and then that's enough.  So, I'm giving them three stars now and will update again after the new year.",
    "category":"Subscription_Boxes"
  },
  {
    "rating":5,
    "parent_asin":"B00PG23QFI",
    "timestamp":"2018-07-01 21:41:14.112",
    "review":"Exactly as advertised. How much can be said about a gift card? Darden owns the restaurants that the person gifted likes so I’m sure it will work out fine.",
    "category":"Gift_Cards"
  },
  {
    "rating":5,
    "parent_asin":"B00ATPGZPA",
    "timestamp":"2015-07-19 00:06:11.000",
    "review":"works just as it supposed to. Is just what I t says it is, a very easy to use stopwatch.",
    "category":"Software"
  },
  {
    "rating":5,
    "parent_asin":"B078JMG2HN",
    "timestamp":"2019-09-19 02:19:42.087",
    "review":"It’s as cute as it looks. So cute. I’m getting tons of compliments.",
    "category":"Unknown"
  },
  {
    "rating":5,
    "parent_asin":"B07W4J36C7",
    "timestamp":"2021-03-15 12:34:12.439",
    "review":"Great product. Love these too. Easy to glide also, great suction,  little ones are great for under eye area.",
    "category":"Health_and_Personal_Care"
  },
  {
    "rating":2,
    "parent_asin":"B09TMNNYWH",
    "timestamp":"2021-01-09 12:51:10.753",
    "review":"T shirt. I tell you what.we have been very happy with this Star Trek t shirts however this last one is awful, I mean really with all the ships and people in the show or even a planet you pick a mouse with a tee shirt on it how sad is that.also just got the last shirt with Riker on it with a back hand palm pretty sad that’s when I canceled the shirts<br \/>Hope this helps some body<br \/>Grant",
    "category":"Subscription_Boxes"
  },
  {
    "rating":5,
    "parent_asin":"B00PFKJFXS",
    "timestamp":"2016-12-30 13:34:37.000",
    "review":"LOVE this color. LOVE this color. Works a lot better than most HTV out there and was for a great price at the time. I needed this quickly and it was to my house earlier than expected.",
    "category":"Arts_Crafts_and_Sewing"
  },
  {
    "rating":5,
    "parent_asin":"7293000154",
    "timestamp":"2019-06-08 08:50:45.736",
    "review":"As advertised. Replacement blades work great and were Norelco and came in a Norelco sealed box",
    "category":"Unknown"
  },
  {
    "rating":2,
    "parent_asin":"0814415466",
    "timestamp":"2014-12-31 05:13:51.000",
    "review":"Two Stars. Wow!",
    "category":"Books"
  },
  {
    "rating":5,
    "parent_asin":"B01M71IUZ7",
    "timestamp":"2018-08-23 20:49:36.203",
    "review":"Gears! Gears! Gears! So fun!!! My twin 4 year olds love the gears! We've had a blast building higher and higher and watching them spin!",
    "category":"Subscription_Boxes"
  },
  {
    "rating":5,
    "parent_asin":"B00XNMDIBU",
    "timestamp":"2016-09-19 10:39:10.000",
    "review":"Five Stars. Good price",
    "category":"Appliances"
  },
  {
    "rating":5,
    "parent_asin":"B01LZYGY8H",
    "timestamp":"2018-10-03 05:52:35.214",
    "review":"Like the good ole days. Just like the one we had as kids. String is a little short but the eyes blink and the phone dial rings.",
    "category":"Toys_and_Games"
  },
  {
    "rating":5,
    "parent_asin":"B00FT8ZHHE",
    "timestamp":"2014-12-22 04:03:54.000",
    "review":"Five Stars. This scale is awesome! I absolutely love it!",
    "category":"Health_and_Household"
  },
  {
    "rating":1,
    "parent_asin":"B07BB3FK19",
    "timestamp":"2019-03-06 20:17:19.703",
    "review":"Acne. This stuff made me break out. I rarely get acne but within the first time using this, I got zits, and on top of that, I couldn't return the product for my money back. No thank you.",
    "category":"Beauty_and_Personal_Care"
  },
  {
    "rating":5,
    "parent_asin":"B08KT63ZVC",
    "timestamp":"2021-08-22 03:42:00.660",
    "review":"It was cold and fresh. Just as good as the name brand will be ordering it again",
    "category":"Grocery_and_Gourmet_Food"
  },
  {
    "rating":5,
    "parent_asin":"B09BYTBD2S",
    "timestamp":"2021-09-24 15:14:03.663",
    "review":"Love these for my small wrist! Doesn’t look bulky. Not bulky looking on my small wrists.",
    "category":"Amazon_Fashion"
  },
  {
    "rating":5,
    "parent_asin":"B07W1YVF6Y",
    "timestamp":"2020-04-08 14:29:09.077",
    "review":"Great filter for the money. Did the job well",
    "category":"Appliances"
  },
  {
    "rating":5,
    "parent_asin":"B0009OAGUG",
    "timestamp":"2017-02-25 21:51:42.000",
    "review":"It's always good. Boom.  It's always good.",
    "category":"Unknown"
  },
  {
    "rating":5,
    "parent_asin":"B08M3SJ19N",
    "timestamp":"2021-04-09 05:16:45.593",
    "review":"Solid, order it! I got the premium indoor box, shipping took 10 days for some reason so be prepared to wait. Despite that long time boxed up both plants arrived in great condition.<br \/><br \/>Admittedly a little expensive for two plants but you're technically paying for shipping and curation as with any other subscription box. Will definitely ride it out and get another months box to see what else we get!",
    "category":"Subscription_Boxes"
  },
  {
    "rating":4,
    "parent_asin":"B09TMNNYWH",
    "timestamp":"2022-06-12 00:50:53.318",
    "review":"So Glad to be in this Club. Love the club but I don't like white tees",
    "category":"Subscription_Boxes"
  },
  {
    "rating":5,
    "parent_asin":"B074N4S7CT",
    "timestamp":"2017-08-09 16:22:25.802",
    "review":"Wonderful New Series. I love these stories but they are entirely too short! The first in the series, the mischievous Lady Lorena and the man she loves, Emmett, have known each other since they were young. Now, they must learn each other as adults. They must discover what is in their truest hearts. Let mayhem begin... there are enough ladies and gems to keep the series flowing...",
    "category":"Unknown"
  },
  {
    "rating":5,
    "parent_asin":"B09W8NHGNB",
    "timestamp":"2022-08-07 00:42:32.688",
    "review":"Good quality. Very well made",
    "category":"Tools_and_Home_Improvement"
  },
  {
    "rating":5,
    "parent_asin":"B01ID3UC1M",
    "timestamp":"2017-03-06 04:33:37.000",
    "review":"Perfect night driving glasses. I was very pleased by the quality of these night driving glasses and the fit is perfect.",
    "category":"Amazon_Fashion"
  },
  {
    "rating":5,
    "parent_asin":"B0009OAGUG",
    "timestamp":"2017-12-11 03:59:20.272",
    "review":"its the real deal. loved it",
    "category":"Unknown"
  },
  {
    "rating":5,
    "parent_asin":"B0768W7G38",
    "timestamp":"2020-01-22 02:55:28.395",
    "review":"Great leather purse for the price! This purse is large enough to hold everything I need it to but with all the pockets things aren’t just floating around. The front pocket is the best! I like the leather stiffness because it doesn’t slouch when I set it down. Overall just a really good purse :)",
    "category":"Handmade_Products"
  },
  {
    "rating":5,
    "parent_asin":"B07Y9WTGKP",
    "timestamp":"2020-11-11 21:27:34.241",
    "review":"Super Cute! Very cute a little smashed in box but I made it work",
    "category":"Clothing_Shoes_and_Jewelry"
  },
  {
    "rating":5,
    "parent_asin":"B01BRVADG6",
    "timestamp":"2017-08-09 11:35:37.781",
    "review":"Five Stars. 2 or 3 time buying I love this oil",
    "category":"All_Beauty"
  },
  {
    "rating":5,
    "parent_asin":"B00XNMDIBU",
    "timestamp":"2018-04-02 01:11:47.903",
    "review":"Five Stars. Fit perfect and work well.",
    "category":"Appliances"
  },
  {
    "rating":5,
    "parent_asin":"B07XZ8R8HT",
    "timestamp":"2020-07-28 00:14:23.989",
    "review":"Best night splint ever. Super comfortable. Comfortable. Comfortable. I'll say it again. Comfortable.",
    "category":"Health_and_Personal_Care"
  },
  {
    "rating":4,
    "parent_asin":"B002DO19HE",
    "timestamp":"2017-02-04 18:37:23.000",
    "review":"Good quality and taste. Surprisingly good for frozen pie shells. Great to have around",
    "category":"Grocery_and_Gourmet_Food"
  },
  {
    "rating":1,
    "parent_asin":"B07414X6SL",
    "timestamp":"2017-12-22 15:18:27.925",
    "review":"A total waste of money. Over half of the ones that I have tried to use are dry - what a waste!!",
    "category":"Health_and_Personal_Care"
  },
  {
    "rating":5,
    "parent_asin":"B07STFMW9L",
    "timestamp":"2019-11-19 03:41:19.462",
    "review":"Great fun product. Great",
    "category":"Subscription_Boxes"
  },
  {
    "rating":5,
    "parent_asin":"B00SW18M8Q",
    "timestamp":"2020-01-22 11:26:27.880",
    "review":"Crush words. I like it and it works good on my new 10\" fire tablet",
    "category":"Software"
  }
]